[
    {
        "type": "General_Information",
        "company": "Adani Enterprises Limited",
        "symbol": "ADANIENT.NS",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "city": "Ahmedabad",
        "website": "https://www.adanienterprises.com"
    },
    {
        "type": "Business_Summary",
        "company": "Adani Enterprises Limited",
        "symbol": "ADANIENT.NS",
        "summary": "Adani Enterprises Limited, together with its subsidiaries, operates as a conglomerate company in India and internationally. It operates through Integrated Resources Management, Mining Services, Commercial Mining, New Energy Ecosystem, Airport, Road, and Others segments. The company offers transport and logistics services; and manufactures cement, hydrogen and its derivatives, polysilicon, ingots, wafers, solar cells with modules, wind turbines, generators, electrolysers, and fuel cells, as well as ammonia and urea. It offers integrated coal management services; imports apples, pears, kiwis, oranges, grapes, and other fruits; markets fruits under the FARM-PIK brand; generates solar and wind energy; and manufactures solar panels. The company is also involved in the mining of iron ore, copper, and aluminum properties; and minerals, such as limestone, chromite, diamond, bauxite, and graphite, as well as mining and trading of coal. In addition, it offers edible oils, rice, pulses, besan, and wheat flour, as well as specialty fats, and oleo chemicals under the Fortune, King's, Bullet, Raag, Avsar, Pilaf, Jubilee, Fryola, Alpha, and Aadhar brands; and manufactures polyvinyl chloride, caustic soda, tar, hydrated lime, etc. Further, the company manufactures fighter aircraft, unmanned aerial systems, helicopters, submarines, air defense guns, and missiles and small arms; develops avionics and systems, opto-electronics, aero structures and components, aerospace composites, and radar and electronic warfare systems, as well as constructs national highways, motorways, tunnels, metro-rail, railways, etc. Additionally, it engages in the sewage and wastewater treatment, recycle, and reuse business; and operates, manage, and develops airports; and develops and operates data centers. The company was founded in 1988 and is headquartered in Ahmedabad, India. Adani Enterprises Limited operates as a subsidiary of S.B. Adani Family Trust."
    },
    {
        "type": "Risk_Profile",
        "company": "Adani Enterprises Limited",
        "symbol": "ADANIENT.NS",
        "audit_risk": 9.0,
        "board_risk": 8.0,
        "compensation_risk": 1.0,
        "shareholder_rights_risk": 10.0,
        "overall_risk": 8.0
    },
    {
        "type": "Executive_Details",
        "company": "Adani Enterprises Limited",
        "symbol": "ADANIENT.NS",
        "executives": [
            {
                "name": "Mr. Gautambhai Shantilal Adani S.Y. B.Com",
                "title": "Executive Chairman",
                "pay": 24600000.0
            },
            {
                "name": "Mr. Jugeshinder  Singh",
                "title": "Chief Financial Officer",
                "pay": 97400000.0
            },
            {
                "name": "Mr. Jatinkumar  Jalundhwala B.Com LLB FCS",
                "title": "Joint President of Legal, Compliance Officer & Company Secretary",
                "pay": 36700000.0
            },
            {
                "name": "Mr. Rajeshbhai Shantilal Adani B.Com.",
                "title": "MD of AEL & Director",
                "pay": 83700000.0
            },
            {
                "name": "Mr. Vinay Prakash Goel",
                "title": "Chief Executive Officer of Natural Resources",
                "pay": 893700000.0
            },
            {
                "name": "Mr. Pranav Vinodbhai Adani",
                "title": "MD of Agro, Oil & Gas and Executive Director",
                "pay": 64600000.0
            },
            {
                "name": "Mr. Sudipta  Bhattacharya",
                "title": "Group C.T.O",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Varsha  Chainani",
                "title": "Head of Corporate Communications",
                "pay": "Not Available"
            },
            {
                "name": "Dr. Malay Rameshchandra Mahadevia",
                "title": "Group Director of HR",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vneet S. Jaain",
                "title": "MD of Adani Green Energy Ltd",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Adani Ports and Special Economic Zone Limited",
        "symbol": "ADANIPORTS.NS",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "city": "Ahmedabad",
        "website": "https://www.adaniports.com"
    },
    {
        "type": "Business_Summary",
        "company": "Adani Ports and Special Economic Zone Limited",
        "symbol": "ADANIPORTS.NS",
        "summary": "Adani Ports and Special Economic Zone Limited, together with its subsidiaries, operates and maintains port infrastructure facilities in India. The company operates ports and terminals, including bulk and break bulk, container, liquid, LPG, LNG, and crude cargos. It also engages in the ports related infrastructure development activities; and development of infrastructure at contiguous Special Economic Zone at Mundra. In addition, it offers logistic services, which includes logistic parks, container rail and bulk cargo logistic solutions, and warehousing, as well as auto, road, and agriculture logistic services. Further, the company operates a fleet of dredging and reclamation service equipment comprising cutter suction, trailing suction hopper, grab, inland cutter suction, water injection, and specialized dredgers, as well as split hopper and jack up barges, and floating cranes. Additionally, it offers non-scheduled passenger airline; hospital and related services; and marine services, such as pilotage, laying, and maintenance of buoys. The company also engages in development, construction, operation, and maintenance of railway corridors; and land development activities. The company was incorporated in 1998 and is headquartered in Ahmedabad, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Adani Ports and Special Economic Zone Limited",
        "symbol": "ADANIPORTS.NS",
        "audit_risk": 8.0,
        "board_risk": 8.0,
        "compensation_risk": 1.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 5.0
    },
    {
        "type": "Executive_Details",
        "company": "Adani Ports and Special Economic Zone Limited",
        "symbol": "ADANIPORTS.NS",
        "executives": [
            {
                "name": "Mr. Gautambhai Shantilal Adani S.Y. B.Com",
                "title": "Executive Chairman",
                "pay": 68000000.0
            },
            {
                "name": "Mr. Ashwani  Gupta",
                "title": "Whole-Time Director & CEO",
                "pay": 125592347.0
            },
            {
                "name": "Mr. D.  Muthukumaran",
                "title": "Chief Financial Officer",
                "pay": 591000.0
            },
            {
                "name": "Mr. Karan Gautam Adani",
                "title": "MD & Director",
                "pay": 39000000.0
            },
            {
                "name": "Mr. Charanjit  Singh",
                "title": "Head - ESG & IR",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Kamlesh  Bhagia",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Captain Sandeep M. Mehta",
                "title": "President of Business Development",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Subrat  Tripathy",
                "title": "Chief Executive Officer of Ports",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Divij  Taneja",
                "title": "Chief Executive Officer of Logistics",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajesh Kumar Jha",
                "title": "MD & CEO of Adani Vizhinjam Port Private Limited",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Apollo Hospitals Enterprise Limited",
        "symbol": "APOLLOHOSP.NS",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "city": "Chennai",
        "website": "https://www.apollohospitals.com"
    },
    {
        "type": "Business_Summary",
        "company": "Apollo Hospitals Enterprise Limited",
        "symbol": "APOLLOHOSP.NS",
        "summary": "Apollo Hospitals Enterprise Limited, together with its subsidiaries, engages in the provision of healthcare services in India and internationally. It operates through Healthcare Services, Retail Health & Diagnostics, Digital Health & Pharmacy Distribution, and Others segments. The company's healthcare facilities comprise primary, secondary, and tertiary care, as well as specialty facilities. It offers services in cardiac sciences, orthopedics, oncology, neurosciences, emergency, robotic surgery, and transplants; and cardiology, neurology, gastroenterology, dermatology, ophthalmology, pediatric, endocrinology, gynecology, urology, nephrology, pulmonology, rheumatology, neurosurgery, radiology, plastic-surgery, neonatology, vascular-surgery, psychiatry, dentistry, ear, nose, and throat care, as well as genomic medicines. The company also provides other services, such as project consultancy, health insurance, medical colleges, medvarsity for e-learning, and research services. In addition, it operates pharmacies, primary care clinics, birthing centers, specialized birthing centers, dialysis centers, cradle and fertility centers, diabetes management centers, single specialty clinics, primary health centers and diagnostic chains, dental clinics, and daycare and home healthcare centers. Further, the company engages in the business of bio-banking of tissues. It serves through national retail healthcare centers and genomics institutes, as well as Apollo 24/7, a digital health mobile platform; and www.apollopharmacy.in, an online pharmacy. The company was incorporated in 1979 and is based in Chennai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Apollo Hospitals Enterprise Limited",
        "symbol": "APOLLOHOSP.NS",
        "audit_risk": 5.0,
        "board_risk": 2.0,
        "compensation_risk": 6.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 3.0
    },
    {
        "type": "Executive_Details",
        "company": "Apollo Hospitals Enterprise Limited",
        "symbol": "APOLLOHOSP.NS",
        "executives": [
            {
                "name": "Dr. Prathap Chandra Reddy FCCP, FICA, FRCS, M.D., MBBS",
                "title": "Founder & Executive Chairman",
                "pay": 184950000.0
            },
            {
                "name": "Ms. Suneeta  Reddy",
                "title": "MD & Executive Director",
                "pay": 76050000.0
            },
            {
                "name": "Dr. Sangita  Reddy M.D.",
                "title": "Joint MD & Executive Director",
                "pay": 70340000.0
            },
            {
                "name": "Dr. P. Preetha Reddy B.Sc., M.D.",
                "title": "Executive Vice-Chairperson",
                "pay": 75860000.0
            },
            {
                "name": "Mr. Krishnan  Akhileswaran",
                "title": "Chief Financial Officer",
                "pay": 45000000.0
            },
            {
                "name": "Mr. S. M. Krishnan",
                "title": "Senior VP of Finance, Compliance Officer & Company Secretary",
                "pay": 12000000.0
            },
            {
                "name": "Mr. Krishnaswami  Padmanabhan",
                "title": "Group President",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Sindoori  Reddy",
                "title": "Vice President of Operations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. G. Dasaratha Rama Reddy",
                "title": "Senior General Manager of Finance & Accounts",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Binod Madhab Samal",
                "title": "Chief Technology Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Asian Paints Limited",
        "symbol": "ASIANPAINT.NS",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "city": "Mumbai",
        "website": "https://www.asianpaints.com"
    },
    {
        "type": "Business_Summary",
        "company": "Asian Paints Limited",
        "symbol": "ASIANPAINT.NS",
        "summary": "Asian Paints Limited, together with its subsidiaries, engages in the manufacturing, selling, and distribution of paints, coatings, and products related to home decoration and bath fittings in Asia, the Middle East, Africa, and the South Pacific region. The company offers wall coverings; textures painting aids; waterproofing products; wall stickers; mechanized tools; adhesives; modular kitchens and wardrobes; bath fittings and sanitaryware; decorative lighting products; fabrics, furniture, furnishings, and rugs; and unplasticized polyvinyl chloride windows and door systems, as well as personalized interior design, safe painting, and color consulting services. It also provides interior and exterior wall finishes, wood finishes, enamels, tools, undercoats, thinners, and varnishers. The company offers its products under the Asian Paints, SCIB Paints, Apco Coatings, Asian Paints Berger, Taubman, Asian Paints Causeway, and Kadisco Asian Paints brand names through a network of dealers and retail stores, as well as operates asianpaints.com, an online shop. Asian Paints Limited was founded in 1942 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Asian Paints Limited",
        "symbol": "ASIANPAINT.NS",
        "audit_risk": 8.0,
        "board_risk": 1.0,
        "compensation_risk": 6.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 1.0
    },
    {
        "type": "Executive_Details",
        "company": "Asian Paints Limited",
        "symbol": "ASIANPAINT.NS",
        "executives": [
            {
                "name": "Mr. Amit  Syngle",
                "title": "MD, CEO & Director",
                "pay": 188219851.0
            },
            {
                "name": "Mr. Ramalingam Jeyapandiyan Jeyamurugan",
                "title": "CFO, Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Savitha  Shivsankar",
                "title": "Chief Human Resources Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Pragyan  Kumar",
                "title": "Chief Executive of Asian Paints International Private Limited",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rahul  Bhatnagar",
                "title": "President of Project Sales, R&T, Industrial JVs and Home Improvement",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Aashish  Kshetry",
                "title": "Vice President of Systems",
                "pay": "Not Available"
            },
            {
                "name": "Harish  Lade",
                "title": "Vice President of Supply Chain",
                "pay": "Not Available"
            },
            {
                "name": "Sameer  Salvi",
                "title": "Vice President of Backward Integration Business, Mantech & Strategy",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Shyam  Swamy",
                "title": "Vice President of Home Improvement, Décor, Services & Retailing",
                "pay": "Not Available"
            },
            {
                "name": "Hiral Kumar Raja",
                "title": "AVP of Accounts, SSC & Taxation",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Axis Bank Limited",
        "symbol": "AXISBANK.NS",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "city": "Mumbai",
        "website": "https://www.axisbank.com"
    },
    {
        "type": "Business_Summary",
        "company": "Axis Bank Limited",
        "symbol": "AXISBANK.NS",
        "summary": "Axis Bank Limited, together with its subsidiaries, engages in the provision of various banking and financial products and services. It operates through four segments: Treasury, Retail Banking, Corporate/Wholesale Banking, and Other Banking Business. The Treasury segment is involved in investments in sovereign and corporate debt, and equity and mutual funds, as well as in trading operations, derivative trading, and foreign exchange operations. The Retail Banking segment engages in the provision of lending services to individuals/small businesses; liability products; card services, including credit, debit, and forex cards; internet banking, mobile banking, and ATM services; retail term deposits; financial advisory services; NRI and digital banking services; bill payment and wealth management services; and distribution of third-party product, such as life and non-life insurance, mutual funds, government bonds, etc. The Corporate/Wholesale Banking segment offers business lending, corporate advisory, placements and syndication, project appraisals, current and corporate term deposits, payments, trade finance products, letter of credits, bank guarantees, commercial cards, cash management, project appraisals, and capital market related services. The Other Banking Business segment is involved in para banking activities. It also engages in investments, broking, asset management, and trustee service and payment activities; operation of MSME digital invoice discounting platform; and government small saving schemes and pension schemes. The company operates multiple branches; ATMs; and recyclers in India. It also has international offices with branches in Singapore and Dubai, and representative offices in Dhaka, Dubai, Abu Dhabi, and Sharjah. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Axis Bank Limited",
        "symbol": "AXISBANK.NS",
        "audit_risk": 1.0,
        "board_risk": 1.0,
        "compensation_risk": 6.0,
        "shareholder_rights_risk": 10.0,
        "overall_risk": 2.0
    },
    {
        "type": "Executive_Details",
        "company": "Axis Bank Limited",
        "symbol": "AXISBANK.NS",
        "executives": [
            {
                "name": "Mr. Amitabh  Chaudhry",
                "title": "MD, CEO & Executive Director",
                "pay": 91011832.0
            },
            {
                "name": "Mr. Rajiv Anand Prattipati",
                "title": "Deputy MD, Executive Director of Wholesale Banking & Executive Director",
                "pay": 61108176.0
            },
            {
                "name": "Mr. Subrat  Mohanty",
                "title": "Executive Director",
                "pay": 29982985.0
            },
            {
                "name": "Mr. Munish  Sharda",
                "title": "Executive Director",
                "pay": 30763233.0
            },
            {
                "name": "Mr. Amitvikram  Talgeri",
                "title": "President & Chief Risk Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Bimal  Bhattacharyya",
                "title": "President",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vineet  Agrawal",
                "title": "President & Chief Audit Executive",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Puneet Mahendra Sharma",
                "title": "Group Executive & CFO",
                "pay": 18405083.0
            },
            {
                "name": "Mr. Anuranjan  Kumar",
                "title": "Chief Compliance Officer and Head-Operational Health & Control",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Julius  Samson",
                "title": "Head, Corporate Communication & Investor Relation",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Bajaj Auto Limited",
        "symbol": "BAJAJ-AUTO.NS",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "city": "Pune",
        "website": "https://www.bajajauto.com"
    },
    {
        "type": "Business_Summary",
        "company": "Bajaj Auto Limited",
        "symbol": "BAJAJ-AUTO.NS",
        "summary": "Bajaj Auto Limited, together with its subsidiaries, engages in the development, manufacture, and distribution of automobiles in India and internationally. The company offers motorcycles, bikes, commercial vehicles, electric two-wheelers, and three-wheeler, as well as related parts. It also exports its products. The company was founded in 1945 and is based in Pune, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Bajaj Auto Limited",
        "symbol": "BAJAJ-AUTO.NS",
        "audit_risk": 8.0,
        "board_risk": 4.0,
        "compensation_risk": 8.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 6.0
    },
    {
        "type": "Executive_Details",
        "company": "Bajaj Auto Limited",
        "symbol": "BAJAJ-AUTO.NS",
        "executives": [
            {
                "name": "Mr. Rajivnayan Rahulkumar Bajaj",
                "title": "MD, CEO & Executive Director",
                "pay": 537536353.0
            },
            {
                "name": "Mr. Pradeep  Shrivastava",
                "title": "Executive Director",
                "pay": 156172680.0
            },
            {
                "name": "Mr. Rakesh  Sharma",
                "title": "Executive Director",
                "pay": 120798813.0
            },
            {
                "name": "Mr. Dinesh  Thapar",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ramtilak  Ananthan",
                "title": "Chief Technology Officer",
                "pay": "Not Available"
            },
            {
                "name": "Anand  Newar",
                "title": "Divisional Manager of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajiv  Gandhi C.S",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Deepika  Warrier",
                "title": "Head of Marketing",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ravi Kyran Ramasamy",
                "title": "Chief Human Resources Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. S.  Ravikumar",
                "title": "Chief Business Development Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Bajaj Finserv Ltd.",
        "symbol": "BAJAJFINSV.NS",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "city": "Pune",
        "website": "https://www.bajajfinserv.in"
    },
    {
        "type": "Business_Summary",
        "company": "Bajaj Finserv Ltd.",
        "symbol": "BAJAJFINSV.NS",
        "summary": "Bajaj Finserv Ltd., through its subsidiaries, engages in the provision of financial services in India. The company operates through Life Insurance, General Insurance, Windpower, Retail Financing, and Investments and Others segments. It offers personal, business, home, home renovation, commercial, car, and gold loans; two- and three-wheeler loans; mortgages; education loans; unsecured and secured loans to small and medium-sized enterprises, micro, small and medium enterprises, and professionals; loans against properties and securities; financing for products, such as consumer electronics, digital, lifecare, furniture, etc.; developer financing; and lease rental discounting products. The company also provides investment products, including fixed deposits, systematic deposit plans, and mutual funds; savings products; life, health, motor, fire, engineering, liabilities, marine, crop, car, two-wheeler, pet, home, travel, and personal accident insurance products; wealth management and retirement planning services; healthcare services comprising wellness, outpatient, and inpatient services; and wallets and credit cards. In addition, it offers pocket subscription plans; bill and recharge services; digital technology services; and trading and demat account, stock broking, margin trading, and HNI and retail broking services. Further, the company owns and operates 138 windmills with total installed capacity of 65.2 megawatts. Bajaj Finserv Ltd. was incorporated in 2007 and is based in Pune, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Bajaj Finserv Ltd.",
        "symbol": "BAJAJFINSV.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "Bajaj Finserv Ltd.",
        "symbol": "BAJAJFINSV.NS",
        "executives": [
            {
                "name": "Mr. Sanjivnayan Rahulkumar Bajaj",
                "title": "Executive Chairman & MD",
                "pay": 316700000.0
            },
            {
                "name": "Mr. Sreenivasan  Sivasubramoniam C.F.A.",
                "title": "Chief Financial Officer",
                "pay": 59791373.0
            },
            {
                "name": "Mr. V.  Rajagopalan",
                "title": "President of Legal & Taxation",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Uma Omkar Shende",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Freeda  Dsouza",
                "title": "Head of Group Corporate Communications",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anish Praful Amin",
                "title": "President of Group Assurance, Risk and Human Resources",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Tarun  Chugh",
                "title": "MD & CEO of Bajaj Allianz Life Insurance Company Ltd.",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rakesh  Bhatt BSc, MCA",
                "title": "Executive Director of Bajaj Finance Ltd.",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Purav A. Jhaveri C.F.A., F.R.M.",
                "title": "President of Investments & CIO",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Kurush Homi Irani",
                "title": "President & Group Head of CSR",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Bajaj Finance Limited",
        "symbol": "BAJFINANCE.NS",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "city": "Pune",
        "website": "https://www.bajajfinserv.in/corporate-bajaj-finance"
    },
    {
        "type": "Business_Summary",
        "company": "Bajaj Finance Limited",
        "symbol": "BAJFINANCE.NS",
        "summary": "Bajaj Finance Limited operates as a deposit-taking non-banking financial company in India. The company offers consumer finance, which includes durable, lifestyle, digital product, EMI card, two and three wheeler, personal loan, loan against fixed deposit, extended warranty, home and gold loans, retail EMI, retailer finance, e-commerce, and co-branded credit card and wallets. It also provides SME finance; and loan against property and shares, lease rental discounting, business and professional loans, working capital loans, and developer and used car finance. In addition, the company offer commercial lending, such as short-term and flexible loan solutions; vendor financing including large value lease rental discounting, loans against securities, financial institution lending, light engineering and corporate finance, and warehouse financing; investment services in fixed deposit and mutual funds; and partnership and services comprising insurance services. Bajaj Finance Limited was formerly known as Bajaj Auto Finance Limited. The company was incorporated in 1987 and is based in Pune, India. Bajaj Finance Limited is a subsidiary of Bajaj Finserv Ltd."
    },
    {
        "type": "Risk_Profile",
        "company": "Bajaj Finance Limited",
        "symbol": "BAJFINANCE.NS",
        "audit_risk": 8.0,
        "board_risk": 5.0,
        "compensation_risk": 4.0,
        "shareholder_rights_risk": 8.0,
        "overall_risk": 4.0
    },
    {
        "type": "Executive_Details",
        "company": "Bajaj Finance Limited",
        "symbol": "BAJFINANCE.NS",
        "executives": [
            {
                "name": "Mr. Rajeev A. Jain",
                "title": "MD & Executive Director",
                "pay": 166000000.0
            },
            {
                "name": "Mr. Anup Kumar Saha",
                "title": "Deputy Managing Director",
                "pay": 131000000.0
            },
            {
                "name": "Mr. Sandeep Vijay Kumar Jain",
                "title": "CFO & Co-Chief Operating Officer",
                "pay": 62407471.0
            },
            {
                "name": "Mr. Deepak  Bagati",
                "title": "President of Debt Management Services & Co-Chief Operating Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anurag  Chottani",
                "title": "CTO & Co-Chief Operating Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Deepak Kumar Gupta Reddy",
                "title": "President of Rural Businesses, Fixed Deposits, Investments, Insurance Services & Distribution",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anupam Krishna Sirbhaiya",
                "title": "Chief Human Resources & Administrative Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ramachandran  Vijay",
                "title": "Company Secretary & Compliance Officer",
                "pay": 10259894.0
            },
            {
                "name": "Mr. Babu  Rao",
                "title": "General Counsel",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Kurush Homi Irani",
                "title": "President of Credit Operations, Customer Experience & Wallets Business",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Bharat Electronics Limited",
        "symbol": "BEL.NS",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "city": "Bengaluru",
        "website": "https://www.bel-india.in"
    },
    {
        "type": "Business_Summary",
        "company": "Bharat Electronics Limited",
        "symbol": "BEL.NS",
        "summary": "Bharat Electronics Limited designs, manufactures, and supplies electronic equipment and systems for the defense and civilian markets in India. The company's defense products include defense communication products, land-based radars, naval systems, electronic warfare systems, avionics, electro optics, tank and armored fighting vehicle electronic systems, weapon systems, C4I systems, shelters and masts, simulators, and batteries; microwave tubes and power modules, microwave super components, digital multichannel data recorders, and hybrid micro circuits; and micro-electro mechanical systems, such as pressure transducers, and conductivity temperature and depth sensors. Its non-defense products comprise e-governance systems, homeland security products, civilian radars, and telecom and broadcast systems; integrated traffic management systems, real time train information systems, and solar power solutions; and PD and strategic products, silicon radiation detectors, passive vacuum devices, EMI filters, and multichannel voice logging recorder systems. The company also offers electronic manufacturing services, including PCB assembly and testing, precision machining and fabrication, opto-electronic components and assemblies, microwave integrated circuit assemblies, super components modules, cable assemblies and wiring harnesses, and antennae manufacturing services; designs and manufactures transformers, coils, chokes, and sub-assemblies; and software services. In addition, it offers cyber security products, such as data diodes and secure storage products; EV charging stations; and platform screen doors. Further, the company provides security architecture conceptualization and consulting, and information security audit services. It exports its products to the United States, France, China, Germany, Switzerland, ASEAN countries, Mauritius, the Republic of Armenia, Sri Lanka, Sweden, and Israel. The company was incorporated in 1954 and is headquartered in Bengaluru, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Bharat Electronics Limited",
        "symbol": "BEL.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "Bharat Electronics Limited",
        "symbol": "BEL.NS",
        "executives": [
            {
                "name": "Mr. Manoj  Jain",
                "title": "MD & Chairman",
                "pay": 8606681.0
            },
            {
                "name": "Mr. Damodar S Bhattad",
                "title": "CFO, Director of Finance & Director",
                "pay": 7027825.0
            },
            {
                "name": "Mr. Kaipa Venkata Suresh Kumar",
                "title": "Director of Marketing, Chief Indigenization Officer & Director",
                "pay": 5697770.0
            },
            {
                "name": "Mr. Nagarajan  Vikraman",
                "title": "Director of HR & Additional Director",
                "pay": 6423842.0
            },
            {
                "name": "Mr. Bhanu Prakash Srivastava",
                "title": "Director of Other Units, R&D and Director",
                "pay": 8001445.0
            },
            {
                "name": "Mr. S.  Sreenivas",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Dr. Binoy Kumar Das",
                "title": "Part-Time Government Additional Director",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Nilabhra  Sengupta",
                "title": "Chief Vigilance Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Bharti Airtel Limited",
        "symbol": "BHARTIARTL.NS",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "city": "New Delhi",
        "website": "https://www.airtel.in"
    },
    {
        "type": "Business_Summary",
        "company": "Bharti Airtel Limited",
        "symbol": "BHARTIARTL.NS",
        "summary": "Bharti Airtel Limited operates as a telecommunications company in India and internationally. It operates through Mobile Services India, Mobile Services Africa, Mobile Services South Asia, Airtel Business, Tower Infrastructure Services, Homes Services, Digital TV Services, and Others segments. The company engages in provision of voice and data telecom services through wireless technology including 2G/3G/4G/5G services; and operates as a single point of contact for telecommunication across data and voice, network integration, and managed services. It also provides services related to setting up, operation, and maintenance of wireless communication towers; and voice and data communications services through fixed-line network and broadband technology for homes, as well as offers digital broadcasting services under the DTH platform. In addition, the company offers post-paid, prepaid, roaming, internet, and various value-added services, as well as mobile TV, video calls, live-streaming videos, gaming, video streaming, and other services; and network integration, data centers, managed services, enterprise mobility applications and digital media services. The company was formerly known as Bharti Tele-Ventures Limited and changed its name to Bharti Airtel Limited in April 2006. Bharti Airtel Limited was incorporated in 1995 and is headquartered in New Delhi, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Bharti Airtel Limited",
        "symbol": "BHARTIARTL.NS",
        "audit_risk": 3.0,
        "board_risk": 2.0,
        "compensation_risk": 6.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 2.0
    },
    {
        "type": "Executive_Details",
        "company": "Bharti Airtel Limited",
        "symbol": "BHARTIARTL.NS",
        "executives": [
            {
                "name": "Mr. Sunil Bharti Mittal",
                "title": "Founder & Executive Chairman",
                "pay": 322714541.0
            },
            {
                "name": "Mr. Gopal Krishna Vittal",
                "title": "MD, CEO & Executive Director",
                "pay": 185508865.0
            },
            {
                "name": "Mr. Soumen  Ray",
                "title": "Chief Financial Officer of India & South Asia",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Pankaj  Tewari",
                "title": "Senior VP & Company Secretary",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Shashwat  Sharma",
                "title": "Chief Operating Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Randeep Singh Sekhon BE",
                "title": "Director of Network & Chief Technical Officer",
                "pay": 2765498.0
            },
            {
                "name": "Mr. Naval  Seth",
                "title": "Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rohit Krishan Puri",
                "title": "Deputy GM of Corporate Secretarial, Compliance Officer & Joint Company Secretary",
                "pay": "Not Available"
            },
            {
                "name": "Vidyut  Gulati",
                "title": "General Counsel & Director of Legal",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Kinshuk  Gupta",
                "title": "Senior VP & Head of Corporate Communications",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Bharat Petroleum Corporation Limited",
        "symbol": "BPCL.NS",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "city": "Mumbai",
        "website": "https://www.bharatpetroleum.in"
    },
    {
        "type": "Business_Summary",
        "company": "Bharat Petroleum Corporation Limited",
        "symbol": "BPCL.NS",
        "summary": "Bharat Petroleum Corporation Limited primarily engages in refining crude oil and marketing petroleum products in India and internationally. It operates through two segments, Downstream Petroleum, and Exploration and Production of Hydrocarbons. The company's fuel stations sell petrol, diesel, automotive liquefied petroleum gas (LPG), and compressed natural gas; operate convenience stores and restaurants; offer money transfer and insurance broking services; and provide vehicle servicing, repair, and maintenance services. It also provides LPG for domestic, commercial, and industrial applications under the Bharatgas brand name; piped natural gas; lubricants, such as automotive engine oils, gear oils, greases, and specialties, as well as industrial lubricants under the MAK brand name; and engages in the production of jet fuel, as well as provision of related transportation, storage, and into plane services to airlines. In addition, the company offers industrial fuels products, such as black and white oils, bitumen, petcoke, sulphur, propylene, petrochemicals, and solvents, as well as marine bunker fuels; and exports naphtha and fuel oils. Its marketing infrastructure includes a network of installations, depots, retail outlets, aviation fueling stations, and LPG distributors. The company was formerly known as Bharat Refineries Limited and changed its name to Bharat Petroleum Corporation Limited in August 1977. Bharat Petroleum Corporation Limited was incorporated in 1952 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Bharat Petroleum Corporation Limited",
        "symbol": "BPCL.NS",
        "audit_risk": 8.0,
        "board_risk": 10.0,
        "compensation_risk": 1.0,
        "shareholder_rights_risk": 4.0,
        "overall_risk": 10.0
    },
    {
        "type": "Executive_Details",
        "company": "Bharat Petroleum Corporation Limited",
        "symbol": "BPCL.NS",
        "executives": [
            {
                "name": "Mr. Krishnakumar  Gopalan",
                "title": "MD & Chairman",
                "pay": 8557634.0
            },
            {
                "name": "Mr. Vetsa RamaKrishna Gupta",
                "title": "Director of Finance & Director",
                "pay": 7615114.0
            },
            {
                "name": "Mr. Sukhmal Kumar Jain",
                "title": "Director of Marketing & Director",
                "pay": 9128755.0
            },
            {
                "name": "Mr. Sanjay  Khanna",
                "title": "Director of Refineries & Additional Director",
                "pay": 8931733.0
            },
            {
                "name": "A.R  Chaudhary",
                "title": "Chief General Manager of Technology",
                "pay": "Not Available"
            },
            {
                "name": "Captain M. J. Mohan B.Sc",
                "title": "Vice President of Administration, Co-Ordination & Liaison",
                "pay": "Not Available"
            },
            {
                "name": "Ms. V.  Kala",
                "title": "Company Secretary & Compliance Officer",
                "pay": 3603129.0
            },
            {
                "name": "Mr. Raj Kumar Dubey",
                "title": "Director of Human Resources & Director",
                "pay": "Not Available"
            },
            {
                "name": "Mr. R. Ranjan Nair",
                "title": "Head of Renewables",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Pawan  Pathak",
                "title": "Senior Vice President of Product",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Britannia Industries Limited",
        "symbol": "BRITANNIA.NS",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "city": "Bengaluru",
        "website": "https://britannia.co.in"
    },
    {
        "type": "Business_Summary",
        "company": "Britannia Industries Limited",
        "symbol": "BRITANNIA.NS",
        "summary": "Britannia Industries Limited manufactures and sells various food products in India and internationally. The company offers biscuits under the Good Day, Marie Gold, NutriChoice, Milk Bikis, Tiger, 50-50, Jim Jam, Britannia Bourbon, Treat, Little Hearts, Pure Magic, Nice Time, and Biscafe brand names; cakes under the Muffills, Fudge It, Gobbles, Layerz, Tiffin Fun, Rollyo, and Nut & Raisin Romance Cake brand names; rusks under the Toastea brand; center filled croissants under the Treat Croissant brand; wafers under Treat Creme Wafers brand; and Snacks under Time Pass brand. It also offers dairy products, such as cheese and dairy whitener, as well as gourmet, wheat flour, and white breads under Britannia brand; milkshakes, lassi, and flavored milk under Winkin' Cow brand; Paneer and Dahi under Come Alive brand; and nutritious bars under Be You Protein Bars brand name. The company exports its products to approximately 80 countries worldwide. Britannia Industries Limited was founded in 1892 and is based in Bengaluru, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Britannia Industries Limited",
        "symbol": "BRITANNIA.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "Britannia Industries Limited",
        "symbol": "BRITANNIA.NS",
        "executives": [
            {
                "name": "Mr. Rajneet  Singh Kohli",
                "title": "CEO & Executive Director",
                "pay": 53268738.0
            },
            {
                "name": "Mr. Varun  Berry",
                "title": "Executive Vice-Chairman & MD",
                "pay": 171649611.0
            },
            {
                "name": "Mr. N.  Venkataraman",
                "title": "CFO & Executive Director",
                "pay": 32966024.0
            },
            {
                "name": "Mr. Ramamurthy  Jayaraman",
                "title": "General Manager of Corporate Finance",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Susheel  Navanale",
                "title": "Chief Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Tharayil Velayudhan Thulsidass",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Burhan  Khalid",
                "title": "General Manager of Legal",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Dipti  Sudhir",
                "title": "Head of Digital Marketing & Public Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sudhir  Nema",
                "title": "Chief Development & Quality Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Amit  Doshi",
                "title": "Chief Marketing Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Cipla Limited",
        "symbol": "CIPLA.NS",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "city": "Mumbai",
        "website": "https://www.cipla.com"
    },
    {
        "type": "Business_Summary",
        "company": "Cipla Limited",
        "symbol": "CIPLA.NS",
        "summary": "Cipla Limited, together with its subsidiaries, engages in the manufacture, development, sale, and distribution of pharmaceutical products in India, the United States, South Africa, and internationally. The company operates through Pharmaceuticals and New Ventures segments. It offers generic and branded generic medicines, vaccines, active pharmaceutical ingredients, and formulations for various therapeutic areas, such as MI, angina, heart disease, pulmonary disease, kidney failure, Alzheimer's disease, hypertension, arrhythmia, lipid abnormalities and diabetes, obesity, central nervous system, HIV/AIDS, respiratory, asthma, urology, oncology, cardio-metabolism, child health, infectious diseases and critical care, hepatitis, women's health, ophthalmology, and neuro psychiatry. The company is also involved in the consumer healthcare, biosimilars, and specialty businesses. Cipla Limited was incorporated in 1935 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Cipla Limited",
        "symbol": "CIPLA.NS",
        "audit_risk": 7.0,
        "board_risk": 4.0,
        "compensation_risk": 8.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 5.0
    },
    {
        "type": "Executive_Details",
        "company": "Cipla Limited",
        "symbol": "CIPLA.NS",
        "executives": [
            {
                "name": "Mr. Umang  Vohra B.E., M.B.A.",
                "title": "MD, Global CEO & Executive Director",
                "pay": 222100000.0
            },
            {
                "name": "Dr. Raju Sunil Mistry M.A., Ph.D.",
                "title": "President & Global Chief People Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Pradeep  Bhadauria",
                "title": "President & Global Chief Scientific Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ashish  Adukia",
                "title": "Global Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Dinesh Ramniranjan Jain",
                "title": "Senior VP & Head of Corporate Finance",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Sneha  Hiranandani B Com",
                "title": "Chief Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Diksha  Maheshwari",
                "title": "Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajendra Kumar Chopra",
                "title": "Compliance Officer & Company Secretary",
                "pay": 15300000.0
            },
            {
                "name": "Ms. Heena  Kanal",
                "title": "Senior Vice-President of Corporate Communications",
                "pay": "Not Available"
            },
            {
                "name": "Dr. Jaideep A. Gogtay M.D., Ph.D.",
                "title": "Global Chief Medical Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Coal India Limited",
        "symbol": "COALINDIA.NS",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "city": "Kolkata",
        "website": "https://www.coalindia.in"
    },
    {
        "type": "Business_Summary",
        "company": "Coal India Limited",
        "symbol": "COALINDIA.NS",
        "summary": "Coal India Limited, together with its subsidiaries, engages in the production and marketing of coal and coal products in India. The company offers coking coal for use in steel making and metallurgical industries, and for hard coke manufacturing; and semi coking coal that is used as blend-able coal in steel making, merchant coke manufacturing, and other metallurgical industries. It also provides non-coking coal that is used as thermal grade coal for power generation, as well as for cement, fertilizer, glass, ceramic, paper, chemical, and brick manufacturing, and other heating purposes. In addition, the company offers washed and beneficiated non-coking coal for use in power generation; beneficiated non-coking coal for use in cement, sponge iron, and other industrial plants; and middling products for power generation and by domestic fuel plants, brick manufacturing units, cement plants, industrial plants, etc. Further, it provides rejects that are used for fluidized bed combustion boilers for power generation, road repairs, briquette making, land filling, etc.; CIL/LTC coke used in furnaces and kilns of industrial units, as well as used as domestic fuel by halwais, hotels, etc.; coal/coke fines used in industrial furnaces, as well as for domestic purposes; and tar, heavy oil, light oil, and soft pitch used in furnaces and boilers of industrial plants, as well as power houses, oil, dye, pharmaceutical industries, etc. The company was incorporated in 1973 and is headquartered in Kolkata, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Coal India Limited",
        "symbol": "COALINDIA.NS",
        "audit_risk": 10.0,
        "board_risk": 10.0,
        "compensation_risk": 1.0,
        "shareholder_rights_risk": 4.0,
        "overall_risk": 10.0
    },
    {
        "type": "Executive_Details",
        "company": "Coal India Limited",
        "symbol": "COALINDIA.NS",
        "executives": [
            {
                "name": "Mr. Polavarapu Mallikharjuna Prasad",
                "title": "Permanent Invitee, MD, Chairman & Director of Technical",
                "pay": 12561116.0
            },
            {
                "name": "Mr. Mukesh  Agrawal",
                "title": "Director of Finance, CFO & Director",
                "pay": 1592660.0
            },
            {
                "name": "Dr. Boothukuru Veera Reddy",
                "title": "Director of Technical & Director",
                "pay": 8169299.0
            },
            {
                "name": "Mr. Vinay  Ranjan",
                "title": "Director of Personnel & Industrial Relations and Director",
                "pay": 6439859.0
            },
            {
                "name": "Mr. Mukesh  Choudhary",
                "title": "Director of Marketing & Director",
                "pay": 4622840.0
            },
            {
                "name": "Mr. Debasish  Nanda",
                "title": "Director of Business Development & Director",
                "pay": 6267913.0
            },
            {
                "name": "S.K.  Bhagat",
                "title": "GM of Administration",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Bijay Prakash Dubey",
                "title": "Company Secretary &  Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Sanjeev  Kumar",
                "title": "GM of Legal",
                "pay": "Not Available"
            },
            {
                "name": "Kavita  Gupta",
                "title": "Head of Corporate Communication & Public Relation Department",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Dr. Reddy's Laboratories Limited",
        "symbol": "DRREDDY.NS",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "city": "Hyderabad",
        "website": "https://www.drreddys.com"
    },
    {
        "type": "Business_Summary",
        "company": "Dr. Reddy's Laboratories Limited",
        "symbol": "DRREDDY.NS",
        "summary": "Dr. Reddy's Laboratories Limited, together with its subsidiaries, operates as an integrated pharmaceutical company worldwide. It operates through Global Generics, Pharmaceutical Services and Active Ingredients (PSAI), and Others segments. The company's Global Generics segment manufactures and markets prescription and over-the-counter finished pharmaceutical products that are marketed under a brand name or as a generic finished dosages with therapeutic equivalence to branded formulations, as well as engages in the biologics business. The PSAI segment manufactures and markets active pharmaceutical ingredients and intermediates, which are principal ingredients for finished pharmaceutical products. This segment also provides contract research services; and manufactures and sells active pharmaceutical ingredients and steroids in accordance with the specific customer requirements. The Others segment engages in developing therapies in the fields of oncology and inflammation; research and development of differentiated formulations; and provides digital healthcare and information technology enabled business support services. The company offers its products for various therapeutic categories primarily include gastro-intestinal, cardiovascular, anti-diabetic, dermatology, oncology, respiratory, stomatology, urology, and nephrology. Dr. Reddy's Laboratories Limited was incorporated in 1984 and is headquartered in Hyderabad, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Dr. Reddy's Laboratories Limited",
        "symbol": "DRREDDY.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "Dr. Reddy's Laboratories Limited",
        "symbol": "DRREDDY.NS",
        "executives": [
            {
                "name": "Mr. Gunupati Venkateswara Prasad B.E.",
                "title": "Co-Chairman, MD & Member of Management Council",
                "pay": 186280000.0
            },
            {
                "name": "Mr. Kallam Satish Reddy B.Tech., M.S.",
                "title": "Chairman of the Board & Member of the Management Council",
                "pay": 116170000.0
            },
            {
                "name": "Mr. Erez  Israeli M.B.A.",
                "title": "CEO & Member of the Management Council",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Mannam  Venkatanarasimham",
                "title": "CFO & Member of the Management Council",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Krishna K. Venkatesh B.Pharma M.S.",
                "title": "Global Head of Quality and Pharmacovigilance & Member of the Management Council",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Deepak  Sapra M.B.A.",
                "title": "CEO of API & Services & Member of Management Council",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Venkata Ramana Motupalli M.B.A.",
                "title": "CEO of Branded Markets - India & Emerging Countries and Member of Management Council",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Archana  Bhaskar B.Sc., M.B.A.",
                "title": "EVP, Head of Corporate Communications, Chief Human Resources Officer & Member of Management Council",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sanjay  Sharma B.Tech.",
                "title": "Executive VP, Global Head of Global Manufacturing & Member of Management Council",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Patrick  Aghanian B.A., M.B.A.",
                "title": "CEO of European Generics & Member of Management Council",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Eicher Motors Limited",
        "symbol": "EICHERMOT.NS",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "city": "Chennai",
        "website": "https://www.eichermotors.com"
    },
    {
        "type": "Business_Summary",
        "company": "Eicher Motors Limited",
        "symbol": "EICHERMOT.NS",
        "summary": "Eicher Motors Limited, an automobile company, engages in the manufacture and sale of motorcycles and commercial vehicles in India and internationally. The company designs, develops, manufactures, assembles, and sells two-wheelers; motorcycle accessories; and apparel, such as protective riding apparel, urban casual wear, and riding accessories for men and women. It owns the Royal Enfield motorcycle brand that offers Classic 350, Bullet 350, Meteor 350, Hunter 350, Himalayan 450, Scram 411, Interceptor 650, Continental GT 650, Super Meteor 650, Shotgun 650, and Thunderbird models. The company also offers through its joint venture, Volvo Eicher Commercial Vehicles Limited, manufactures and sells light and medium duty trucks, heavy duty trucks, and buses under the Eicher and Volvo brands; and connected vehicles under Eicher LIVE. In addition, it provides medium-duty base engines, engineering components, and aggregates. The company was founded in 1901 and is headquartered in Chennai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Eicher Motors Limited",
        "symbol": "EICHERMOT.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "Eicher Motors Limited",
        "symbol": "EICHERMOT.NS",
        "executives": [
            {
                "name": "Mr. Siddhartha Vikram Lal PGDME",
                "title": "MD, CEO & Executive Director",
                "pay": 312560000.0
            },
            {
                "name": "Mr. Govindarajan  Balakrishnan",
                "title": "Whole Time Additional Director",
                "pay": 70800000.0
            },
            {
                "name": "Ms. Vidhya  Srinivasan",
                "title": "Chief Financial Officer",
                "pay": 9000000.0
            },
            {
                "name": "R.  Anbuselvan BSC. B.TECH",
                "title": "Head of Aggregates, Technology & Testing and Divisional General Manager of Product Development",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Atul  Sharma",
                "title": "Company Secretary & Compliance Officer",
                "pay": 2700000.0
            },
            {
                "name": "Mr. Venkatesan  Sambandam BE, MBA",
                "title": "Head of Procurement for Royal Enfield Unit",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Samrat  Som",
                "title": "Head of Royal Enfield Apparel & Accessories Business",
                "pay": "Not Available"
            },
            {
                "name": "James  Young",
                "title": "Head of Engines",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sudhakar  Bhagavatula",
                "title": "Chief Information Officer of Royal Enfield",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajeev  Sharma",
                "title": "Chief Human Resource Officer of Royal Enfield",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Grasim Industries Limited",
        "symbol": "GRASIM.NS",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "city": "Mumbai",
        "website": "https://www.grasim.com"
    },
    {
        "type": "Business_Summary",
        "company": "Grasim Industries Limited",
        "symbol": "GRASIM.NS",
        "summary": "Grasim Industries Limited, together with its subsidiaries, primarily operates in fibre, yarn, pulp, chemicals, textile, fertilizers, and insulators businesses in India and internationally. The company operates through Cellulosic Fibres, Chemicals, Building Materials, Financial Services, and Others segments. The Cellulosic Fibres segments offers cellulosic staple fibre; and cellulosic fashion yarn. The Chemicals segment provides chlor-alkali comprising caustic soda; chlorine derivatives, such as chloromethanes and phosphoric acid; and specialty chemicals, that include epoxy polymers and curing agents. The Building Materials segment offers grey cement, white cement-based putty, and ready-mix concrete; and decorative paints comprising interior and exterior water- based paints, enamel paints, wood finishes, waterproofing solutions, and wallpapers under the Birla Opus brand name. This segment also provides painting services under the PaintCraft brand name; and operates Birla Pivot, a business-to-business e-commerce platform for building and construction materials, as well as credit solutions. The Financial Services segment offers non-banking financial services, housing finance, asset management, and health and life insurance, protection, investments, advisory, and value-added services. The Others segment provides textile products, such as linen fabrics, wool tops and worsted yarn, and cotton fabrics under Linen Club, Cavallo, Soktas, and Giza House brands; manufactures and sells ceramic and composite insulators for transmission and distribution lines, sub-stations, power equipment, and railway electrification industries; and engages in the generation of electricity of 894 MW capacity through 42 project comprising solar panels, wind turbines, solar-wind hybrids, and floating solar systems. The company was incorporated in 1947 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Grasim Industries Limited",
        "symbol": "GRASIM.NS",
        "audit_risk": 4.0,
        "board_risk": 8.0,
        "compensation_risk": 7.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 8.0
    },
    {
        "type": "Executive_Details",
        "company": "Grasim Industries Limited",
        "symbol": "GRASIM.NS",
        "executives": [
            {
                "name": "Mr. Pavan Kumar Jain ACS, B.Com., FCA",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Hemant K. Kadel B.Com., FCA",
                "title": "Senior President of Corporate Finance Division",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ankit  Panchmatia",
                "title": "Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sailesh Kumar Daga",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Krishna Kishore Maheshwari F.C.A., M.Com.",
                "title": "Business Head of Cement",
                "pay": 43037000.0
            },
            {
                "name": "Dr. Aspi  Patel",
                "title": "Chief Technology Officer of Fibre & Pulp Business",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Jayant  Dua",
                "title": "Business Head of Solar & Textiles",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Manmohan  Singh",
                "title": "Chief Marketing Officer of Cellulosic Fibre",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anil  Rustogi",
                "title": "Chief Financial Officer of Pulp & Fibre Business",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Manoj  Kedia",
                "title": "Chief Financial Officer of Chemicals, Fashion Yarn & Insulators Business",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "HCL Technologies Limited",
        "symbol": "HCLTECH.NS",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "city": "Noida",
        "website": "https://www.hcltech.com"
    },
    {
        "type": "Business_Summary",
        "company": "HCL Technologies Limited",
        "symbol": "HCLTECH.NS",
        "summary": "HCL Technologies Limited offers software development, business process outsourcing, and infrastructure management services worldwide. It operates through IT and Business Services; Engineering and R&D Services; and HCL Software segments. It offers digital business services, which includes digital consulting, data and AI, application development, maintenance, and modernization, software as a service, automation and integration, and enterprise application; and digital foundation services including digital foundation consulting and workplace, hybrid cloud, cybersecurity, network, intelligent operator, and unified services management services. The company provides digital process operations, such as lending solution, supply chain management, finance and accounting, digital and content, and cognitive automation; and engineering and R&D services, which includes digital engineering, manufacturing operation, product engineering, and industry verticals. It offers CloudSMART, an adaptive portfolio of solutions enabling continuous modernization; IoT WoRKS, which offers digital transformation services; Career Shaper, earning and assessment platform for driving talent transformation; and HCLTech X, a cloud based digital platform that integrates content, commerce, and engagement tools. The company also provides engineering services and solutions for software, embedded, mechanical; modernized software products; and artificial intelligence solutions. It serves aerospace and defense, energy and utilities, manufacturing, public sector, telecom, media and entertainment, captive business services, technology, mining and natural resources, retail, consumer goods, life sciences and healthcare, oil and gas, banking, insurance, capital markets, fintech, and financial crime compliance and risk, as well as travel, transport, logistics, and hospitality industries. It has strategic partnership with Intellect Design Arena Ltd. The company was founded in 1976 and is headquartered in Noida, India."
    },
    {
        "type": "Risk_Profile",
        "company": "HCL Technologies Limited",
        "symbol": "HCLTECH.NS",
        "audit_risk": 1.0,
        "board_risk": 2.0,
        "compensation_risk": 1.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 1.0
    },
    {
        "type": "Executive_Details",
        "company": "HCL Technologies Limited",
        "symbol": "HCLTECH.NS",
        "executives": [
            {
                "name": "Mr. ChinnaSwamy  VijayaKumar",
                "title": "CEO, MD & Director",
                "pay": 263511245.0
            },
            {
                "name": "Mr. Shiv  Nadar",
                "title": "Founder, Chairman Emeritus & Strategic Advisor to the Board",
                "pay": 18100000.0
            },
            {
                "name": "Mr. Shiv Kumar Walia",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vijay Anand Guntur M.B.A., M.Sc.",
                "title": "CTO & Head of Ecosystems",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ajit Krishnankutty Kumar",
                "title": "Chief Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ashutosh  Kaushik",
                "title": "Senior Vice President of Global Administration",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Nitin  Mohta",
                "title": "Senior VP & Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Manish  Anand",
                "title": "Senior VP, Compliance Officer & Company Secretary",
                "pay": 15600000.0
            },
            {
                "name": "Mr. Raghu Raman Lakshmanan",
                "title": "General Counsel",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Jill  Kouri",
                "title": "Global Chief Marketing Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "HDFC Bank Limited",
        "symbol": "HDFCBANK.NS",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "city": "Mumbai",
        "website": "https://www.hdfcbank.com"
    },
    {
        "type": "Business_Summary",
        "company": "HDFC Bank Limited",
        "symbol": "HDFCBANK.NS",
        "summary": "HDFC Bank Limited engages in the provision of banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, Singapore, and Dubai. The company operates in three segments: Treasury, Retail Banking, Wholesale Banking, and Other Banking Services. It accepts savings, salary, current, rural, public provident fund, pension, and demat accounts; fixed and recurring deposits; and safe deposit lockers, as well as offshore accounts and deposits, and overdrafts against fixed deposits. The company also provides personal, home, car, two-wheeler, business, doctor, educational, gold, consumer, and rural loans; loans against properties, securities, mutual funds, rental receivables, and assets; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, healthcare/medical equipment and commercial vehicle finance, dealer finance, and term loans. In addition, it offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, and merchant and cash management services; insurance and investment products. Further, the company provides short term finance, bill discounting, structured finance, export credit, loan repayment, and documents collection services; online and wholesale, mobile, and phone banking services; unified payment interface, immediate payment, national electronic funds transfer, and real time gross settlement services; and channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. It operates branches and automated teller machines in various cities/towns. The company was incorporated in 1994 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "HDFC Bank Limited",
        "symbol": "HDFCBANK.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "HDFC Bank Limited",
        "symbol": "HDFCBANK.NS",
        "executives": [
            {
                "name": "Mr. Sashidhar  Jagdishan",
                "title": "MD, CEO & Director",
                "pay": 107714372.0
            },
            {
                "name": "Mr. Bhavesh Chandulal Zaveri",
                "title": "Group Head of Operations, ATM, Cash Management Product & Executive Director",
                "pay": 42348492.0
            },
            {
                "name": "Mr. Kaizad Maneck Bharucha",
                "title": "Deputy MD & Director",
                "pay": 111285459.0
            },
            {
                "name": "Mr. Vedanthachari Srinivasa Rangan",
                "title": "Executive Whole-Time Director",
                "pay": 44231714.0
            },
            {
                "name": "Mr. Srinivasan  Vaidyanathan",
                "title": "Chief Financial Officer",
                "pay": 30179680.0
            },
            {
                "name": "Mr. Rakesh K. Singh",
                "title": "Group Head of Invst. Bank., Private Bank., Inter. Bank., Digi. Ecosystems & BaaS",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ramesh  Lakshminarayanan",
                "title": "Chief Information Officer & Group Head of IT",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ajit Subhas Shetty",
                "title": "Investor Relations Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rakesh Kumar Rajput",
                "title": "Chief Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sudhir Kumar Jha",
                "title": "Head & Group General Counsel",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "HDFC Life Insurance Company Limited",
        "symbol": "HDFCLIFE.NS",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "city": "Mumbai",
        "website": "https://www.hdfclife.com"
    },
    {
        "type": "Business_Summary",
        "company": "HDFC Life Insurance Company Limited",
        "symbol": "HDFCLIFE.NS",
        "summary": "HDFC Life Insurance Company Limited provides individual and group insurance solutions in India. It offers insurance and investment products, such as protection, pension, savings, investment, annuity, and health, as well as term, retirement, children, and unit linked insurance plans. The company was formerly known as HDFC Standard Life Insurance Company Limited changed its name to HDFC Life Insurance Company Limited in January 2019. HDFC Life Insurance Company Limited was incorporated in 2000 and is headquartered in Mumbai, India. HDFC Life Insurance Company Limited is a subsidiary of HDFC Bank Limited."
    },
    {
        "type": "Risk_Profile",
        "company": "HDFC Life Insurance Company Limited",
        "symbol": "HDFCLIFE.NS",
        "audit_risk": 5.0,
        "board_risk": 4.0,
        "compensation_risk": 8.0,
        "shareholder_rights_risk": 8.0,
        "overall_risk": 5.0
    },
    {
        "type": "Executive_Details",
        "company": "HDFC Life Insurance Company Limited",
        "symbol": "HDFCLIFE.NS",
        "executives": [
            {
                "name": "Ms. Vibha U. Padalkar",
                "title": "MD, CEO & Director",
                "pay": 102391000.0
            },
            {
                "name": "Mr. Niraj Ashwin Shah",
                "title": "CFO & Executive Director",
                "pay": 69759000.0
            },
            {
                "name": "Mr. Sameer  Yogishwar",
                "title": "Chief Operating Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Prasun  Gajri",
                "title": "Chief Investment Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Narendra Yeshwant Gangan",
                "title": "General Counsel, Chief Compliance Officer & Company Secretary",
                "pay": 19240000.0
            },
            {
                "name": "Subrato  Roy",
                "title": "SVP - Corporate Communications, PR & CSR",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vibhash  Naik",
                "title": "Chief Human Resources Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Khushru  Sidhwa",
                "title": "Chief Risk Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vineet  Arora",
                "title": "Chief Business Officer - Distribution, Data and Technology",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Eshwari  Murugan",
                "title": "Actuary",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Hero MotoCorp Limited",
        "symbol": "HEROMOTOCO.NS",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "city": "New Delhi",
        "website": "https://www.heromotocorp.com"
    },
    {
        "type": "Business_Summary",
        "company": "Hero MotoCorp Limited",
        "symbol": "HEROMOTOCO.NS",
        "summary": "Hero MotoCorp Limited primarily engages in the manufacture and sale of motorized two wheelers in India, Asia, Central and Latin America, Africa, and the Middle East. The company offers motorcycles and scooters, as well as electric scooters. It provides engines, parts, and accessories, as well as related services. The company was formerly known as Hero Honda Motors Ltd. and changed its name to Hero MotoCorp Limited in July 2011. Hero MotoCorp Limited was incorporated in 1984 and is based in New Delhi, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Hero MotoCorp Limited",
        "symbol": "HEROMOTOCO.NS",
        "audit_risk": 5.0,
        "board_risk": 6.0,
        "compensation_risk": 10.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 10.0
    },
    {
        "type": "Executive_Details",
        "company": "Hero MotoCorp Limited",
        "symbol": "HEROMOTOCO.NS",
        "executives": [
            {
                "name": "Dr. Pawan Kant Munjal B.E. (Mech.)",
                "title": "Executive Chairman",
                "pay": 1094100000.0
            },
            {
                "name": "Mr. Niranjan Kumar Gupta",
                "title": "Chief Executive Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vivek  Anand",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Dhiraj  Kapoor",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vikram Sitaram Kasbekar IIT",
                "title": "Executive Director",
                "pay": 121100000.0
            },
            {
                "name": "Mr. Surender Kumar Chhabra",
                "title": "Vice President of Corporate Finance",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Reema  Jain",
                "title": "Chief Information & Digital Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Umang Deep Singh Khurana",
                "title": "Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Pooja  Yadava",
                "title": "General Counsel",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Bharatendu  Kabi",
                "title": "Head of Corporate Communications & Corporate Social Responsibility",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Hindalco Industries Limited",
        "symbol": "HINDALCO.NS",
        "sector": "Basic Materials",
        "industry": "Aluminum",
        "city": "Mumbai",
        "website": "https://www.hindalco.com"
    },
    {
        "type": "Business_Summary",
        "company": "Hindalco Industries Limited",
        "symbol": "HINDALCO.NS",
        "summary": "Hindalco Industries Limited, together with its subsidiaries, produces and sells aluminum and copper products in India and internationally. The company operates through Novelis, Aluminium Upstream, Aluminium Downstream, and Copper segments. It offers fine and reactive alumina; primary aluminum in the form of ingots, billets, and wire rods; aluminum flat rolled products (FRP), including sheets, stocks, plates, coils, and circles; aluminum extrusions; and aluminum foil and packaging solutions for use in the automotive and transport, building and construction, aerospace and defense, electrical and electronics, pharmaceuticals and packaging, consumer durables and kitchenware, and white goods industries, as well as industrial applications. The company also provides coarse alumina hydrate for use in alum, poly aluminum chloride, zeolites, aluminum fluoride, sodium aluminate, glass, catalysts, and aluminum hydroxide gel; fine alumina hydrates; and calcined alumina for use in ceramics, refractories, polishing, and flame retardants. In addition, it offers copper products, including copper cathodes and continuous cast copper rods that are used in the agrochemical, automotive and transport, consumer durable, electrical equipment, railway, wire and cable, and electric vehicle and renewables industries; and precious metals comprising gold and silver bars, as well as selenium powder. Further, the company operates an all-weather jetty in the Gulf of Khambhat on the west coast of India; produces di-ammonium phosphate and nitrogen phosphorus potassium complexes; and offers phosphoric acid, phosphogypsum, sulfuric acid, copper slag, and aluminum fluoride. It offers its aluminum extrusion products under the Hindalco extrusions, Maxloader, Eternia, and Totalis brands; aluminum FRP under the Everlast brand; aluminum foils under the Freshwrapp and Superwrap brands; and copper products under the Birla Balwan brand. The company was incorporated in 1958 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Hindalco Industries Limited",
        "symbol": "HINDALCO.NS",
        "audit_risk": 2.0,
        "board_risk": 9.0,
        "compensation_risk": 5.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 8.0
    },
    {
        "type": "Executive_Details",
        "company": "Hindalco Industries Limited",
        "symbol": "HINDALCO.NS",
        "executives": [
            {
                "name": "Mr. Satish  Pai",
                "title": "MD & Executive Director",
                "pay": 338344124.0
            },
            {
                "name": "Mr. Praveen Kumar Maheshwari B.Com., C.A., PGDM",
                "title": "CFO & Whole Time Director",
                "pay": 83661319.0
            },
            {
                "name": "Ms. Geetika Raghunandan Anand",
                "title": "Company Secretary & Compliance Officer",
                "pay": 10065558.0
            },
            {
                "name": "Mr. Anil Kumar Malik IAS",
                "title": "President",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vilas  Tathavadkar",
                "title": "Chief Technology Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Poorav  Sheth",
                "title": "Chief Digital & Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Subir  Sen",
                "title": "Deputy GM & Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. V. R. Shankar",
                "title": "Head - Chief Legal Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Samik  Basu",
                "title": "Chief Human Resource Officer",
                "pay": "Not Available"
            },
            {
                "name": "Dr. Pragnya  Ram",
                "title": "Group Executive President of CSR, Legacy Documentation & Archives",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Hindustan Unilever Limited",
        "symbol": "HINDUNILVR.NS",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "city": "Mumbai",
        "website": "https://www.hul.co.in"
    },
    {
        "type": "Business_Summary",
        "company": "Hindustan Unilever Limited",
        "symbol": "HINDUNILVR.NS",
        "summary": "Hindustan Unilever Limited, a fast-moving consumer good company, manufactures and sells food, home care, personal care, and refreshment products in India and internationally. The company operates through Home Care, Beauty & Personal Care, Foods & Refreshment, and Others segments. The Home Care segment engages in detergent bars and powders, detergent liquids, scourers, water business, purifiers business, etc. The Beauty & Personal Care segment provides oral, skin, and hair care products; and soaps, deodorants, talcum powder, color cosmetics, salon services, etc. The Foods & Refreshment segment provides culinary products, including tomato-based products, fruit-based products, soups, etc.; and tea, coffee, nutrition drinks, ice-cream, and frozen desserts. The Others segment engages in activities, such as export, consignment, etc. The company is also involved in the job work, real estate, and discharge trust businesses. The company was founded in 1888 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Hindustan Unilever Limited",
        "symbol": "HINDUNILVR.NS",
        "audit_risk": 3.0,
        "board_risk": 4.0,
        "compensation_risk": 4.0,
        "shareholder_rights_risk": 8.0,
        "overall_risk": 3.0
    },
    {
        "type": "Executive_Details",
        "company": "Hindustan Unilever Limited",
        "symbol": "HINDUNILVR.NS",
        "executives": [
            {
                "name": "Mr. Rohit  Jawa",
                "title": "MD, CEO & Whole-Time Director",
                "pay": 223900000.0
            },
            {
                "name": "Mr. Ritesh  Tiwari",
                "title": "CFO, Executive Director of Finance & IT and Whole-Time Director",
                "pay": 85600000.0
            },
            {
                "name": "Mr. Devopam Narendra Bajpai",
                "title": "Executive Director of Legal & Corp. Affairs, Compliance Officer, Secretary and Whole Time Director",
                "pay": 103800000.0
            },
            {
                "name": "Ms. Shilpa  Kedia",
                "title": "Group Financial Controller & Head Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Deepa  Dey",
                "title": "Head of Communication & Sustainability of Nutrition and Special Projects",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Bittianda Ponnappa Biddappa",
                "title": "Executive Human Resources & Whole time Director",
                "pay": "Not Available"
            },
            {
                "name": "Dr. Vibhav Ramrao Sanzgiri",
                "title": "Executive Director of Research & Development",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Priya  Nair",
                "title": "President of  Beauty & Wellbeing",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Harman  Dhillon",
                "title": "Executive Director of Beauty & Well-being",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vipul  Mathur",
                "title": "Head of Growth and Transformation for South Asia & Executive Director of Personal Care",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "ICICI Bank Limited",
        "symbol": "ICICIBANK.NS",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "city": "Mumbai",
        "website": "https://www.icicibank.com"
    },
    {
        "type": "Business_Summary",
        "company": "ICICI Bank Limited",
        "symbol": "ICICIBANK.NS",
        "summary": "ICICI Bank Limited, together with its subsidiaries, engages in the provision of various banking and financial services to retail and corporate customers in India and internationally. The company operates through Retail Banking, Wholesale Banking, Treasury, Other Banking, Life Insurance, and Others segments. It accepts savings, salary, pension, current, trade, escrow, foreign currency, and vostro accounts, as well as time, fixed, recurring, and security deposits services. The company also provides home, car, two-wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, including working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and overdraft facilities, as well as loans for new entities and card swipes; and credit, debit, prepaid, travel, forex, and corporate cards. In addition, it offers pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, initial public offerings, and other online investment services; and agri and rural business, farmer finance, tractor loans, and micro banking services. Further, the company provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, and institutional banking services; health, personal accident, fire, and motor insurance, as well as distributes general and life insurance products; and Internet, mobile, and phone banking services. Additionally, it offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, pension fund management, asset management, investment advisory, points of presence, and private equity/venture capital fund management services. The company was founded in 1955 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "ICICI Bank Limited",
        "symbol": "ICICIBANK.NS",
        "audit_risk": 2.0,
        "board_risk": 1.0,
        "compensation_risk": 7.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 1.0
    },
    {
        "type": "Executive_Details",
        "company": "ICICI Bank Limited",
        "symbol": "ICICIBANK.NS",
        "executives": [
            {
                "name": "Mr. Sandeep  Bakhshi B.E.",
                "title": "MD, CEO & Executive Director",
                "pay": 99655999.0
            },
            {
                "name": "Mr. Anindya  Banerjee",
                "title": "Group CFO & Head of Investor Relations",
                "pay": 11356505.0
            },
            {
                "name": "Mr. Rakesh  Jha BE, PGDM",
                "title": "Executive Director",
                "pay": 83963832.0
            },
            {
                "name": "Mr. Sandeep  Batra A.C.S., B.Com., CA, CS, F.C.A.",
                "title": "Executive Director",
                "pay": 86735648.0
            },
            {
                "name": "Mr. Ajay Kumar Gupta B.Com, CA",
                "title": "Executive Director",
                "pay": 48286785.0
            },
            {
                "name": "Mr. Laxminarayan  Achar",
                "title": "Chief Accountant",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Prachiti Deepak Lalingkar",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Prasanna  Balachander",
                "title": "Head of Markets & Proprietory Trading and Group Executive",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Akshay  Chaturvedi",
                "title": "Country Head of USA",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajendra  Khandelwal",
                "title": "Chief Internal Auditor",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "IndusInd Bank Limited",
        "symbol": "INDUSINDBK.NS",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "city": "Mumbai",
        "website": "https://www.indusind.com"
    },
    {
        "type": "Business_Summary",
        "company": "IndusInd Bank Limited",
        "symbol": "INDUSINDBK.NS",
        "summary": "IndusInd Bank Limited engages in the provision of various banking products and services to individuals, NRIs, business owners, corporates, and government and financial institutions. It operates through four segments: Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. The company offers current, savings, defense, and corporate salary; fixed and FCNR, sweep in/out, time and term deposits; and senior citizen schemes, young saver deposits, and recurring and RFC deposits, as well as Rupee multiplier products. It also provides home, personal, gold, car, two-wheeler, commercial vehicle, professional, agricultural, and medical equipment loans, as well as loans against properties and securities; credit cards; micro-finance, working capital, and MSME and business loans, as well as loans to merchants and retailers, and loan on credit cards. In addition, the company offers transaction banking services, including letters of credit/guarantees, structured trade and export finance, and import finance solutions, as well as cash management and remittance services; safe deposit lockers; investment products, such as demat account, mutual fund, gold bond, national pension system, and equity trading; project finance, supply chain financing; investment advisory, strategic mergers and acquisitions, and other advisory services; and health, general, life, and card protection insurance. Further, it provides debit, prepaid, forex, and commercial cards; individual outward remittances, foreign currency bank notes and demand drafts, and travelers cheques; financial inclusion products; trade and foreign exchange accounts; real estate developer financing and bullion services; correspondent banking services; and forex and derivative desk, information and advisory, and remittances through forex channel services. The company was incorporated in 1994 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "IndusInd Bank Limited",
        "symbol": "INDUSINDBK.NS",
        "audit_risk": 1.0,
        "board_risk": 1.0,
        "compensation_risk": 4.0,
        "shareholder_rights_risk": 10.0,
        "overall_risk": 1.0
    },
    {
        "type": "Executive_Details",
        "company": "IndusInd Bank Limited",
        "symbol": "INDUSINDBK.NS",
        "executives": [
            {
                "name": "Mr. Sumant  Kathpalia",
                "title": "MD, CEO & Additional Director",
                "pay": 75000000.0
            },
            {
                "name": "Mr. Arun  Khurana",
                "title": "Deputy CEO & Whole time Executive Director and Head of Gems,Jewellery business",
                "pay": 50000000.0
            },
            {
                "name": "Mr. K. S. Sridhar",
                "title": "President",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Gobind  Jain C.F.A.",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Siddharth  Banerjee",
                "title": "Head of Investment Banking, Global Markets & Financial Institutions Group",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Bhavesh  Lakhani",
                "title": "Chief Technology Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anil M. Rao",
                "title": "Chief Administrative Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Indrajit  Yadav",
                "title": "Head of Investor Relations & Strategy",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sachin Shamkant Patange",
                "title": "Chief Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Soumitra  Sen",
                "title": "Head of Consumer Bank & Marketing",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Infosys Limited",
        "symbol": "INFY.NS",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "city": "Bengaluru",
        "website": "https://www.infosys.com"
    },
    {
        "type": "Business_Summary",
        "company": "Infosys Limited",
        "symbol": "INFY.NS",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides digital marketing and digital workplace, digital commerce, digital experience and interactions, metaverse, data analytics and AI, applied AI, generative AI, sustainability, blockchain, engineering, Internet of Things, enterprise agile DevOps, application modernization, cloud, digital process automation, digital supply chain, Microsoft business application and cloud business, service experience transformation, energy transition, cyber security, and quality engineering solutions; Oracle, SAP, and Saleforce solutions; API economy and microservices; and Topaz, an AI-first set of services, solutions, and platforms using generative AI technologies. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Panaya platform, Infosys Equinox, Infosys Helix, Infosys Applied AI, Infosys Cortex, and Stater digital platforms; and Infosys McCamish, an insurance platform. It serves aerospace and defense, agriculture, automotive, chemical manufacturing, communication, consumer packaged goods, education, engineering procurement and construction, healthcare, high technology, industrial manufacturing, information services and publishing, insurance, life science, logistics and distribution, media, entertainment, mining, oil and gas, private equity, professional, public, retail, travel, hospitality, utilities, and waste management industries. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was incorporated in 1981 and is headquartered in Bengaluru, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Infosys Limited",
        "symbol": "INFY.NS",
        "audit_risk": 7.0,
        "board_risk": 5.0,
        "compensation_risk": 4.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 4.0
    },
    {
        "type": "Executive_Details",
        "company": "Infosys Limited",
        "symbol": "INFY.NS",
        "executives": [
            {
                "name": "Mr. Nandan M. Nilekani",
                "title": "Co-Founder & Chairman",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Salil Satish Parekh",
                "title": "MD, CEO & Director",
                "pay": 275445871.0
            },
            {
                "name": "Ms. Inderpreet  Sawhney",
                "title": "Executive VP, Group General Counsel & Chief Compliance Officer",
                "pay": 91059332.0
            },
            {
                "name": "Mr. Shaji  Mathew",
                "title": "Group Head of Human Resources Development",
                "pay": 21418513.0
            },
            {
                "name": "Mr. Jayesh  Sanghrajka",
                "title": "Chief Financial Officer",
                "pay": 15023414.0
            },
            {
                "name": "Mr. Anand  Swaminathan",
                "title": "Executive VP and Segment Head of Communication, Media & Technology",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sandeep  Mahindroo",
                "title": "VP, Financial Controller & Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sumit  Virmani",
                "title": "Executive VP & Chief Marketing Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Srikantan  Moorthy",
                "title": "Executive VP, Head of US operation and Global Head of Education, Training & Assessment",
                "pay": 55273246.0
            },
            {
                "name": "Mr. Narsimha Rao Mannepalli",
                "title": "Head, Global Services \u0096 Cloud, Infra. & Security Solutions & Independent Validation Solutions & EVP",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "ITC Limited",
        "symbol": "ITC.NS",
        "sector": "Consumer Defensive",
        "industry": "Tobacco",
        "city": "Kolkata",
        "website": "https://www.itcportal.com"
    },
    {
        "type": "Business_Summary",
        "company": "ITC Limited",
        "symbol": "ITC.NS",
        "summary": "ITC Limited engages in the fast-moving consumer goods, hotels, paperboards and paper and packaging, agri, and information technology businesses in India and internationally. It primarily offers cigarettes and cigars; staples, spices, biscuits, confectionery and gums, snacks, noodles and pasta, beverages, dairy, ready to eat meals, chocolate, coffee, and frozen foods; personal care products; notebooks, pens and pencils, geometry boxes, erasers, sharpeners, rulers, wax and plastic crayons, sketch pens, and oil pastels; safety matches; and incense sticks under various brands. The company also operates hotels under the ITC Hotel, Mementos, Welcomhotel, Storii, Fortune, and WelcomHeritage brands; and Kaya Kalp spas. In addition, it offers virgin, recycled, coated barrier, cupstock base, liner, liquid packaging, anti-fungal, solid, and graphic boards, as well as specialty papers; overlay, surfacing/print base, barrier, and liner papers; plastic substitution products; and packaging products, such as carton board, flexible, tobacco, and green packaging products. Further, the company exports feed ingredients, food grains, marine products, processed fruits, coffee products, leaf tobacco products, and spices; and offers information technology services for the banking, financial services, consumer goods, manufacturing, travel, hospitality, and healthcare industries. Additionally, it provides property infrastructure and estate maintenance; engineering, procurement, and construction management; project management consultancy; cartooning and wrapping; conveyor; and business consulting, real estate development, and agro-forestry and other related services. The company also manages and operates golf courses; fabricates and assembles machinery for tube filling; and produces and commercializes seed potato technology products. ITC Limited was incorporated in 1910 and is headquartered in Kolkata, India."
    },
    {
        "type": "Risk_Profile",
        "company": "ITC Limited",
        "symbol": "ITC.NS",
        "audit_risk": 3.0,
        "board_risk": 6.0,
        "compensation_risk": 8.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 6.0
    },
    {
        "type": "Executive_Details",
        "company": "ITC Limited",
        "symbol": "ITC.NS",
        "executives": [
            {
                "name": "Mr. Sanjiv  Puri",
                "title": "Chairman & MD",
                "pay": 251779000.0
            },
            {
                "name": "Mr. Supratim  Dutta",
                "title": "CFO & Whole Time Director",
                "pay": 56678000.0
            },
            {
                "name": "Mr. Rajendra Kumar Singhi",
                "title": "Executive VP, Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Arif  Nazeeb",
                "title": "Head of Corporate Communications & Executive VP",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sumant  Bhargavan",
                "title": "Whole time Director",
                "pay": 119192000.0
            },
            {
                "name": "Mr. Anil K. Rajput",
                "title": "President of ITC Corporate Affairs",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Hemant  Malik",
                "title": "Whole Time Director & Divisional Chief Executive of Foods Business",
                "pay": 24937000.0
            },
            {
                "name": "Mr. Surampudi  Sivakumar",
                "title": "Group Head of Agri Business",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Tunal Kumar Ghosal",
                "title": "Head of ISC, Compliance Officer & Deputy Secretary",
                "pay": "Not Available"
            },
            {
                "name": "Datta  S.",
                "title": "Chief Risk Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "JSW Steel Limited",
        "symbol": "JSWSTEEL.NS",
        "sector": "Basic Materials",
        "industry": "Steel",
        "city": "Mumbai",
        "website": "https://www.jswsteel.in"
    },
    {
        "type": "Business_Summary",
        "company": "JSW Steel Limited",
        "symbol": "JSWSTEEL.NS",
        "summary": "JSW Steel Limited engages in the manufacture and sale of iron and steel products in India and internationally. It provides color coated steel products, color-coated roofing sheets, galvalume coil and sheets, aluminum-zinc sheets, galvanized corrugated sheets, tin plate products, lead-free coils and sheets, Al-Zn-Mg coated galvanized steel, multi-utility steel sheets, hot rolled and cold-rolled coils, cold rolled close annealed, electrical, coated steel products, TMT bars, wire rods, alloy steel products, and steel doors under the JSW Silveron+, JSW Radiance, JSW Everglow, JSW Colouron+, JSW Pragati+, JSW Vishwas, JSW Vishwas+, JSW Galvos, JSW Galveco, JSW Platina, JSW Neosteel, JSW Trusteel, JSW Avante, and JSW Magsure brands. The company is also involved in trades in steel and allied products, and iron ore products; logistic infrastructure, real estate, and mining; manufactures forged steel ball, slabs, plates, pipes, and double jointing; production of gaseous and liquid form of oxygen, nitrogen, argon, and other products recoverable from separation of air; scrap shredding; and operation of coke oven and pellet plant, and steel plant. Its products are used in automotive, general engineering, machinery, and projects and construction sectors. The company was formerly known as Jindal Vijayanagar Steel Limited and changed its name to JSW Steel Limited in June 2005. JSW Steel Limited was founded in 1982 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "JSW Steel Limited",
        "symbol": "JSWSTEEL.NS",
        "audit_risk": 4.0,
        "board_risk": 8.0,
        "compensation_risk": 4.0,
        "shareholder_rights_risk": 10.0,
        "overall_risk": 7.0
    },
    {
        "type": "Executive_Details",
        "company": "JSW Steel Limited",
        "symbol": "JSWSTEEL.NS",
        "executives": [
            {
                "name": "Mr. Sajjan Kumar Jindal B.E.",
                "title": "Non Independent Executive Chairman & MD",
                "pay": 733900000.0
            },
            {
                "name": "Mr. Jayant  Acharya",
                "title": "CEO, Joint MD & Whole-Time Director",
                "pay": 162700000.0
            },
            {
                "name": "Mr. Gajraj Singh Rathore BE, MET",
                "title": "COO, President of Dolvi & Whole-time Director",
                "pay": 93200000.0
            },
            {
                "name": "Mr. Swayam  Saurabh",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ashwin Shivkumar Bajaj",
                "title": "Group Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Lancy  Varghese ACS, LLB, M.Com",
                "title": "Compliance Officer & Company Secretary",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Biswadip  Gupta",
                "title": "President of Corporate Affairs - East",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vinay  Shroff",
                "title": "Chief Marketing Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Dilip  Pattanayak",
                "title": "President and CHRO - Steel & Corporate",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ashok Kumar Aggrawal",
                "title": "President of Business Development",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Kotak Mahindra Bank Limited",
        "symbol": "KOTAKBANK.NS",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "city": "Mumbai",
        "website": "https://www.kotak.com"
    },
    {
        "type": "Business_Summary",
        "company": "Kotak Mahindra Bank Limited",
        "symbol": "KOTAKBANK.NS",
        "summary": "Kotak Mahindra Bank Limited provides a range of banking and financial services to corporate and individual customers in India. It operates through Treasury, BMU and Corporate Centre; Retail Banking; Corporate / Wholesale Banking; Digital Banking; Other Retail Banking; Vehicle Financing; Other Lending Activities; Broking; Advisory and Transactional Services; Asset Management; and Insurance segments. The company offers savings, current, and salary accounts; fixed, recurring, tax saving fixed, senior citizen, and fixed deposit products; home, personal, business, payday, gold, education, commercial vehicle, car, and crop loans, as well as loan against securities and properties; construction equipment, farm equipment, healthcare, trade and supply chain, and working capital finance solutions; and prepaid, credit, and debit cards. It also provides Investment products; life, term, health, car, and two wheeler insurance; payment services; trade services; business management and marketing, enterprise resource planning, supply chain and logistics, human resource, business travel, workspace management, taxation and legal, and healthcare/medical equipment services; cash management services, such as digital payments, physical collections, digital collections, and payment gateways; private banking services; net banking; and NRI services. Kotak Mahindra Bank Limited was incorporated in 1985 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Kotak Mahindra Bank Limited",
        "symbol": "KOTAKBANK.NS",
        "audit_risk": 7.0,
        "board_risk": 1.0,
        "compensation_risk": 4.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 1.0
    },
    {
        "type": "Executive_Details",
        "company": "Kotak Mahindra Bank Limited",
        "symbol": "KOTAKBANK.NS",
        "executives": [
            {
                "name": "Mr. Ashok Valiram Vaswani",
                "title": "MD, CEO & Director",
                "pay": 53145000.0
            },
            {
                "name": "Ms. Shanti  Ekambaram",
                "title": "Deputy MD & Director",
                "pay": 63373000.0
            },
            {
                "name": "Mr. Paul  Parambi",
                "title": "Group President & Group Chief Risk Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Milind  Nagnur",
                "title": "Group President, CTO & COO",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Devang C. Gheewalla",
                "title": "Group Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. T. V. Raghunath",
                "title": "Head of Corporate & Investment Banking",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Himanshu V. Vasa",
                "title": "Chief Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Prasanna  Kotian",
                "title": "Head of Group Corporate Communication",
                "pay": "Not Available"
            },
            {
                "name": "Rohit  Bhasin",
                "title": "President of Propositions & Chief Marketing Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anupam  Kaura",
                "title": "Chief Human Resources Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Larsen & Toubro Limited",
        "symbol": "LT.NS",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "city": "Mumbai",
        "website": "https://www.larsentoubro.com"
    },
    {
        "type": "Business_Summary",
        "company": "Larsen & Toubro Limited",
        "symbol": "LT.NS",
        "summary": "Larsen & Toubro Limited engages in engineering, construction, and manufacturing operations in India and internationally. The Infrastructure Projects segment is involved in the engineering and construction of building and factories, transportation infrastructure, heavy civil infrastructure, power transmission and distribution, water and effluent treatment, and minerals, and metals. The Energy Projects segment provides front-end design, modular fabrication, procurement, project management, construction, installation, and commissioning services for the oil and gas industry; coal-based and gas-based thermal power plants, including power generation equipment with associated systems and balance-of-plant packages; and engineering, procurement, and construction solutions in green energy space. The Hi-Tech Manufacturing segment designs, manufactures/constructs, supplies, and revamps/retrofits engineered critical equipment and systems for the process plants, nuclear energy, and green hydrogen sectors; marine and land platforms, and related equipment and systems, as well as aerospace products and systems, and precision and electronics products and systems for defense, security, space, and industrial sectors; and electrolysers. The IT & Technology Services segment offers information technology and integrated engineering services, e-commerce/digital platforms and data centres, and semiconductor chip design solutions. The Financial Services segment provides retail and wholesale financing services. The Development Projects segment develops, operates, and maintains infrastructure projects; and engages in toll and fare collection, as well as power generation and development activities. The Others segment manufactures and sells industrial valves and rubber processing machinery; manufactures, markets and services construction equipment and parts; and markets and services mining machinery and parts. Larsen & Toubro Limited was founded in 1938 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Larsen & Toubro Limited",
        "symbol": "LT.NS",
        "audit_risk": 5.0,
        "board_risk": 7.0,
        "compensation_risk": 8.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 7.0
    },
    {
        "type": "Executive_Details",
        "company": "Larsen & Toubro Limited",
        "symbol": "LT.NS",
        "executives": [
            {
                "name": "Mr. Sekharipuram Narayanan Subrahmanyan",
                "title": "MD & Chairman",
                "pay": 510500000.0
            },
            {
                "name": "Mr. Ramamurthi Shankar Raman",
                "title": "President, CFO & Whole-Time Director",
                "pay": 316600000.0
            },
            {
                "name": "Mr. Azhakankumarath Sivaram Nair",
                "title": "Company Secretary & Compliance Officer",
                "pay": 17200000.0
            },
            {
                "name": "Mr. Subramanian  Sarma",
                "title": "Whole-time Director & President of Energy",
                "pay": 370300000.0
            },
            {
                "name": "Mr. Tharayil Madhava Das B.Tech.",
                "title": "Senior EVP of Utilities & Whole-Time Director",
                "pay": 187400000.0
            },
            {
                "name": "Mr. Sudhindra Vasantrao Desai",
                "title": "Senior EVP of Civil Infrastructure & Whole-Time Director",
                "pay": 192100000.0
            },
            {
                "name": "Mr. Anil Vithal Parab",
                "title": "Senior EVP of Heavy Engineering & L&T Valves and Whole-Time Director",
                "pay": 125200000.0
            },
            {
                "name": "Mr. R.  Govindan",
                "title": "Senior Vice President of Corporate Finance & Enterprise Risk Management",
                "pay": "Not Available"
            },
            {
                "name": "Marnix  Coomans",
                "title": "Technical Head",
                "pay": "Not Available"
            },
            {
                "name": "Bahadur  Hitendra",
                "title": "Head of Administration",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Mahindra & Mahindra Limited",
        "symbol": "M&M.NS",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "city": "Mumbai",
        "website": "https://www.mahindra.com"
    },
    {
        "type": "Business_Summary",
        "company": "Mahindra & Mahindra Limited",
        "symbol": "M&M.NS",
        "summary": "Mahindra & Mahindra Limited provides mobility products and farm solutions in India and internationally. It operates through Automotive, Farm Equipment, Financial Services, Real Estate, Hospitality, and Others segments. The company offers commercial vehicles, trucks, buses, vans, passenger cars, utility vehicles, and electric vehicles (EV), as well as motorcycles; aero and defense products; offers construction equipment, such as rotaries, tillers, loaders, and backhoes under the Mahindra EarthMaster brand; and road construction equipment comprising motor graders under the Mahindra RoadMaster brand. It is also involved in the provision of farm equipment, including tractors under the Mahindra, Swaraj, and Trakstar brands, as well as farm mechanization solutions, such as rotavators, cultivators, harvesters, rice transplanters, balers, sprayers, and implements and attachments; and renewable energy business comprising installation of EV chargers and provision of Li-ion batteries. In addition, the company offers financial services, such as fixed deposits, retail and other loans, leasing, SME finance, housing finance, mutual funds, and life and non-life insurance broking services, as well as vehicle and equipment financing; provides logistics services; power backup solutions, including diesel and gas generators; and technology services comprising business process, integrated engineering, infrastructure and cloud, network, application development and maintenance, supply chain digital transformation, and design services. Further, it engages in the sale of timeshare and vacation ownership through its resorts; develops and sells residential properties, and engages in the development, management, and operation of commercial complexes; and processing and trading of steel for automotive, non-automotive, and power industries. The company was incorporated in 1945 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Mahindra & Mahindra Limited",
        "symbol": "M&M.NS",
        "audit_risk": 3.0,
        "board_risk": 4.0,
        "compensation_risk": 7.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 4.0
    },
    {
        "type": "Executive_Details",
        "company": "Mahindra & Mahindra Limited",
        "symbol": "M&M.NS",
        "executives": [
            {
                "name": "Mr. Anand Gopal Mahindra",
                "title": "Non-Executive Chairman & Member of Group Executive Board",
                "pay": 51500000.0
            },
            {
                "name": "Dr. Anish Dilip Shah Ph.D.",
                "title": "MD, Group CEO, Member of the Group Executive Board & Director",
                "pay": 242222000.0
            },
            {
                "name": "Mr. Rajesh Ganesh Jejurikar",
                "title": "Executive Director & CEO of Automotive and Farm Sectors & Member of Group Exe Board",
                "pay": 192481000.0
            },
            {
                "name": "Mr. Manoj  Bhat",
                "title": "Member of Group Executive Board",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Narayan  Shankar",
                "title": "Compliance Officer & Company Secretary",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Amarjyoti  Barua",
                "title": "President & Group Chief Financial Officer & Member of Executive Board",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ruzbeh  Irani",
                "title": "President of Group Human Resources & Member of the Group Executive Board",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Hemant  Sikka",
                "title": "President of Farm Equipment Sector & Member of Group Executive Board",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Veejay Ram Nakra",
                "title": "President of Auto Sector & Member of Group Executive Board",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vinod  Sahay",
                "title": "President of Aerospace & Defence, CPO of Auto & Farm Sectors and Member of Group Executive Board",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Maruti Suzuki India Limited",
        "symbol": "MARUTI.NS",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "city": "New Delhi",
        "website": "https://www.marutisuzuki.com"
    },
    {
        "type": "Business_Summary",
        "company": "Maruti Suzuki India Limited",
        "symbol": "MARUTI.NS",
        "summary": "Maruti Suzuki India Limited engages in the manufacture, purchase, and sale of motor vehicles, components, and spare parts primarily in India. The company offers passenger vehicles, utility vehicles, and multi-purpose vehicles. It is also involved in the facilitation of pre-owned car sales, fleet management, and car financing activities. In addition, the company offers driving school, accessories, insurance, and financing products and services. It also exports its products to Mexico, Chile, Saudi Arabia, South Africa, Philippines, and internationally. The company was formerly known as Maruti Udyog Limited and changed its name to Maruti Suzuki India Limited in September 2007. Maruti Suzuki India Limited was incorporated in 1981 and is headquartered in New Delhi, India. Maruti Suzuki India Limited operates as a subsidiary of Suzuki Motor Corporation."
    },
    {
        "type": "Risk_Profile",
        "company": "Maruti Suzuki India Limited",
        "symbol": "MARUTI.NS",
        "audit_risk": 3.0,
        "board_risk": 6.0,
        "compensation_risk": 5.0,
        "shareholder_rights_risk": 8.0,
        "overall_risk": 4.0
    },
    {
        "type": "Executive_Details",
        "company": "Maruti Suzuki India Limited",
        "symbol": "MARUTI.NS",
        "executives": [
            {
                "name": "Mr. Hisashi  Takeuchi",
                "title": "MD, CEO, & Whole-Time Director",
                "pay": 51085850.0
            },
            {
                "name": "Mr. Kazunari  Yamaguchi",
                "title": "Director of Production & Additional Director",
                "pay": 6328903.0
            },
            {
                "name": "Mr. Kenichiro  Toyofuku",
                "title": "Director of Corporate Planning & Whole Time Director",
                "pay": 39712783.0
            },
            {
                "name": "Mr. Arnab  Roy",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajiv  Gandhi",
                "title": "Senior Executive Officer of Production & Member of the Executive Board (Strategic Projects)",
                "pay": "Not Available"
            },
            {
                "name": "Mr. C. V. Raman",
                "title": "Member of Executive Committee",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajesh  Uppal",
                "title": "Member Executive Committee",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Randhir Singh Kalsi",
                "title": "Member of Executive Board (Process & Audit - Marketing & Sales)",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rahul  Bharti",
                "title": "Head of Corporate Affairs & Chief Investor Relations Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Manjaree  Chowdhary",
                "title": "Executive Officer of Legal & General Counsel",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Nestlé India Limited",
        "symbol": "NESTLEIND.NS",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "city": "Gurugram",
        "website": "https://www.nestle.in"
    },
    {
        "type": "Business_Summary",
        "company": "Nestlé India Limited",
        "symbol": "NESTLEIND.NS",
        "summary": "Nestlé India Limited manufactures and sells food products in India and internationally. It provides milk products and nutrition, including dairy whitener, condensed and UHT milk, yoghurt, maternal and infant formula, baby food, and health care nutrition products; powdered and liquid beverages comprising instant coffee and tea, as well as ready to drink beverages; prepared dishes and cooking aids, such as noodles, sauces, seasonings, pasta, cereals, and pet foods; and confectionery products consisting of bar countlines, tablets, and sugar confectionery products. The company was incorporated in 1959 and is headquartered in Gurugram, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Nestlé India Limited",
        "symbol": "NESTLEIND.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "Nestlé India Limited",
        "symbol": "NESTLEIND.NS",
        "executives": [
            {
                "name": "Mr. Suresh  Narayanan",
                "title": "Chairman & MD",
                "pay": 294010000.0
            },
            {
                "name": "Ms. Svetlana Leonidovna Boldina",
                "title": "CFO, Executive Director of Finance & Control and Additional Whole-time Director",
                "pay": 95850000.0
            },
            {
                "name": "Mr. Satish Dhawan Srinivasan",
                "title": "Executive Director of Technical & Director",
                "pay": 26070000.0
            },
            {
                "name": "Mr. Pramod Kumar Rai",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ambereen Ali Shah",
                "title": "Head of Media Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sanjay  Khajuria",
                "title": "Head of Corporate Affairs & Sustainability",
                "pay": "Not Available"
            },
            {
                "name": "Jagdeep  Marahar",
                "title": "Head of R&D Center in Manesar",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Taruna  Saxena",
                "title": "Head of Sustainability",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anurag  Dikshit",
                "title": "Assistant Vice President of Treasury and M&A",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "NTPC Limited",
        "symbol": "NTPC.NS",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "city": "New Delhi",
        "website": "https://www.ntpc.co.in"
    },
    {
        "type": "Business_Summary",
        "company": "NTPC Limited",
        "symbol": "NTPC.NS",
        "summary": "NTPC Limited primarily engages in the generation and sale of bulk power to state power utilities in India. It operates through two segments: Generation of Energy and Others. The company generates power from coal, gas, liquid fuel, hydro, solar, nuclear, wind, thermal, and renewable energy sources. It offers consultancy, project management, and supervision services. In addition, the company is involved in the energy trading, oil and gas exploration, and coal mining activities. Further, the company sells electricity to private DISCOMs operating in various states. NTPC Limited was incorporated in 1975 and is based in New Delhi, India."
    },
    {
        "type": "Risk_Profile",
        "company": "NTPC Limited",
        "symbol": "NTPC.NS",
        "audit_risk": 5.0,
        "board_risk": 10.0,
        "compensation_risk": 3.0,
        "shareholder_rights_risk": 4.0,
        "overall_risk": 9.0
    },
    {
        "type": "Executive_Details",
        "company": "NTPC Limited",
        "symbol": "NTPC.NS",
        "executives": [
            {
                "name": "Mr. Gurdeep  Singh",
                "title": "Chairman of the Board & MD",
                "pay": 15908735.0
            },
            {
                "name": "Mr. Jaikumar  Srinivasan",
                "title": "CFO, Director of Finance & Director",
                "pay": 7594950.0
            },
            {
                "name": "Mr. Ravindra  Kumar",
                "title": "Director of Operations & Director",
                "pay": 5279425.0
            },
            {
                "name": "Mr. Shivam  Srivastava",
                "title": "Chief General Manager, Fuel Director & Director",
                "pay": 8260249.0
            },
            {
                "name": "Mr. K. Shanmugha Sundaram",
                "title": "Director of Projects & Executive Director",
                "pay": 5856873.0
            },
            {
                "name": "Mr. Aditya  Dar",
                "title": "Chief Investor Relations Officer & Executive Director of Finance",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Ritu  Arora",
                "title": "GM, Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anil Kumar Jadli",
                "title": "Director of HR & Director",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Mahabir  Prasad",
                "title": "Joint Secretary, Financial Advisor & Government Nominee Director",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Oil and Natural Gas Corporation Limited",
        "symbol": "ONGC.NS",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "city": "New Delhi",
        "website": "https://www.ongcindia.com"
    },
    {
        "type": "Business_Summary",
        "company": "Oil and Natural Gas Corporation Limited",
        "symbol": "ONGC.NS",
        "summary": "Oil and Natural Gas Corporation Limited, together with its subsidiaries, engages in the exploration, development, and production of crude oil and natural gas in India and internationally. It operates through Exploration and Production, and Refining & Marketing segments. The company also engages in the refining and marketing of petroleum products; transportation of oil and natural gas; and production of liquefied petroleum gas, naphtha, ethane/propane, butane, kerosene oil, low sulphur heavy stock, aviation turbine fuel, mineral turpentine oil, carbon credits, and diesel. In addition, it generates wind power through a total installed capacity of 153.9 MW; and solar power through a total installed capacity of 39.52 MW, as well as generates geothermal power. The company was incorporated in 1993 and is based in New Delhi, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Oil and Natural Gas Corporation Limited",
        "symbol": "ONGC.NS",
        "audit_risk": 10.0,
        "board_risk": 9.0,
        "compensation_risk": 1.0,
        "shareholder_rights_risk": 8.0,
        "overall_risk": 8.0
    },
    {
        "type": "Executive_Details",
        "company": "Oil and Natural Gas Corporation Limited",
        "symbol": "ONGC.NS",
        "executives": [
            {
                "name": "Mr. Arun Kumar Singh B.Sc., B.Sc. (Engg.)",
                "title": "Chairman, CEO and Director of Strategy & Corporate Affairs",
                "pay": 10650000.0
            },
            {
                "name": "Mr. Om Prakash Singh",
                "title": "Director of Technical & Field Services and Whole Time Director",
                "pay": 9470000.0
            },
            {
                "name": "Mr. Manish  Patil",
                "title": "Director of Human Resources & Executive Director",
                "pay": 8660000.0
            },
            {
                "name": "Mr. Pankaj  Kumar",
                "title": "Director of Production & Director",
                "pay": 9480000.0
            },
            {
                "name": "Ms. Sushma  Rawat",
                "title": "Director of Exploration & Director",
                "pay": 10210000.0
            },
            {
                "name": "Mr. Vivek Chandrakant Tongaonkar",
                "title": "CFO, Director of Finance & Whole-Time Director",
                "pay": "Not Available"
            },
            {
                "name": "Mr. S.  Dhandapani",
                "title": "Chief of Corporate Finance and Group General Manager",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajni Kant Jain",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Arunangshu  Sarkar",
                "title": "Director of Strategy & Corporate Affairs",
                "pay": "Not Available"
            },
            {
                "name": "Lakhi Chand Sah",
                "title": "Chief Engineer of Production",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Power Grid Corporation of India Limited",
        "symbol": "POWERGRID.NS",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Electric",
        "city": "Gurugram",
        "website": "https://www.powergrid.in"
    },
    {
        "type": "Business_Summary",
        "company": "Power Grid Corporation of India Limited",
        "symbol": "POWERGRID.NS",
        "summary": "Power Grid Corporation of India Limited, an electric power transmission utility, engages in the transmission of power in India and internationally. The company operates in three segments: Transmission Services, Telecom Services, and Consultancy Services. As of June 30, 2024, it owned and operated 1,77,790 circuit kilometers of transmission lines, as well as 278 substations with transformation capacity of 5,28,761 mega volt ampere. The company also provides consultancy services, including power system planning and techno-economic feasibility studies; environmental and social impact assessment; design and engineering; procurement assistance; project management and construction supervision; asset management; and other services, such as owners' and lenders' engineer service; grid code and tariff mechanisms preparation; legal and technical advisory; and market analysis advisory services, as well as renewable energy certificate mechanism implementation. In addition, it provides overhead optic fiber network services using optical ground wire on power transmission lines under the POWERTEL brand name; and operates electric vehicle charging stations. The company was formerly known as National Power Transmission Corporation Limited and changed its name to Power Grid Corporation of India Limited in October 1992. Power Grid Corporation of India Limited was incorporated in 1989 and is based in Gurugram, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Power Grid Corporation of India Limited",
        "symbol": "POWERGRID.NS",
        "audit_risk": 6.0,
        "board_risk": 10.0,
        "compensation_risk": 5.0,
        "shareholder_rights_risk": 4.0,
        "overall_risk": 10.0
    },
    {
        "type": "Executive_Details",
        "company": "Power Grid Corporation of India Limited",
        "symbol": "POWERGRID.NS",
        "executives": [
            {
                "name": "Mr. Ravindra Kumar Tyagi",
                "title": "Chairman, MD & Director of Projects",
                "pay": 9176879.0
            },
            {
                "name": "Mr. Ravisankar  Ganesan",
                "title": "CFO, Director of Finance & Director",
                "pay": 8124100.0
            },
            {
                "name": "Dr. Yatindra  Dwivedi",
                "title": "Director of Personnel & Director",
                "pay": 7468467.0
            },
            {
                "name": "Mr. Satyaprakash  Dash",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Lieutenant S. R. Choudhary",
                "title": "Director of Projects & Director",
                "pay": "Not Available"
            },
            {
                "name": "S.C.  Agarwal",
                "title": "Chief Operating Officer of Telecom",
                "pay": "Not Available"
            },
            {
                "name": "P.V.  Nath",
                "title": "Executive Director and CISO of ERP & IT, Information Security",
                "pay": "Not Available"
            },
            {
                "name": "Yugesh Kumar Dixit",
                "title": "Chief Operating Officer of International Business, BDD & PI",
                "pay": "Not Available"
            },
            {
                "name": "Mr. A.  Nagaraju",
                "title": "BR Head and Executive Director of ESMD & CSR",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Dharmendra Kumar Madan",
                "title": "Chief Vigilance Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Reliance Industries Limited",
        "symbol": "RELIANCE.NS",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "city": "Mumbai",
        "website": "https://www.ril.com"
    },
    {
        "type": "Business_Summary",
        "company": "Reliance Industries Limited",
        "symbol": "RELIANCE.NS",
        "summary": "Reliance Industries Limited engages in hydrocarbon exploration and production, oil and chemicals, textile, retail, digital, material and composites, renewables, and financial services businesses worldwide. It operates through Oil to Chemicals, Oil and Gas, Retail, Digital Services, and Others segments. The company produces and markets petroleum products, such as liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosene oil, diesel, sulphur, and petroleum coke. It also provides petrochemicals, including high-density and low-density polyethylene (PE), linear low-density PE, polyester fibers and yarns, polypropylene, polyvinyl chloride, purified terephthalic acid, ethylene glycols and oxide, paraxylene, ortho xylene, benzene, linear alkyl benzene and paraffin, poly butadiene rubber, styrene butadiene rubber, butyl rubber, and polyethylene terephthalate. In addition, the company manufactures and markets yarns, fabrics, apparel, and auto furnishings; explores, develops, and produces crude oil and natural gas; and operates various stores comprising neighborhood, supermarket, hypermarket, wholesale cash and carry, specialty, online stores, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, consumer electronics, connectivity products, and others. Further, the company provides range of digital television, gaming, broadband, and telecommunication services under the Jio brand name; and non-banking financial and insurance broking services. Additionally, it operates news and entertainment platforms, and Network18 and television channels; publishes magazines; and offers highway hospitality and fleet management services. The company was founded in 1957 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Reliance Industries Limited",
        "symbol": "RELIANCE.NS",
        "audit_risk": 9.0,
        "board_risk": 9.0,
        "compensation_risk": 7.0,
        "shareholder_rights_risk": 1.0,
        "overall_risk": 9.0
    },
    {
        "type": "Executive_Details",
        "company": "Reliance Industries Limited",
        "symbol": "RELIANCE.NS",
        "executives": [
            {
                "name": "Mr. Mukesh Dhirubhai Ambani",
                "title": "Chairman & MD",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Nikhil Rasiklal Meswani",
                "title": "Executive Director",
                "pay": 253100000.0
            },
            {
                "name": "Mr. Hital Rasiklal Meswani",
                "title": "Executive Director",
                "pay": 254200000.0
            },
            {
                "name": "Mr. Panda Madhusudana Siva Prasad",
                "title": "Executive Director",
                "pay": 179300000.0
            },
            {
                "name": "Ms. Parul  Sharma",
                "title": "Group President",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Srikanth  Venkatachari",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Hemen Kanu Modi",
                "title": "Vice President of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Savithri  Parekh",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rohit  Bansal",
                "title": "Group Head of Communications",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Mukund  Pendse",
                "title": "Marketing Manager",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "SBI Life Insurance Company Limited",
        "symbol": "SBILIFE.NS",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "city": "Mumbai",
        "website": "https://www.sbilife.co.in"
    },
    {
        "type": "Business_Summary",
        "company": "SBI Life Insurance Company Limited",
        "symbol": "SBILIFE.NS",
        "summary": "SBI Life Insurance Company Limited operates as a private life insurance company in India. The company's life insurance business comprising individual and group life insurance products, including participating, non-participating, pension, group gratuity, group leave encashment, group superannuation, individual and group immediate annuity, unit-linked and variable insurance products, health, and micro insurance. It also provides accident and disability benefit, level term, and critical illness insurance products. The company offers its products through a multi-channel distribution network comprising individual agents, brokers, corporate agents, bancassurance partners, as well as certified insurance facilitators. It operates various partner branches. The company was incorporated in 2000 and is based in Mumbai, India. SBI Life Insurance Company Limited operates as a subsidiary of State Bank of India."
    },
    {
        "type": "Risk_Profile",
        "company": "SBI Life Insurance Company Limited",
        "symbol": "SBILIFE.NS",
        "audit_risk": 1.0,
        "board_risk": 6.0,
        "compensation_risk": 7.0,
        "shareholder_rights_risk": 8.0,
        "overall_risk": 5.0
    },
    {
        "type": "Executive_Details",
        "company": "SBI Life Insurance Company Limited",
        "symbol": "SBILIFE.NS",
        "executives": [
            {
                "name": "Mr. Amit  Jhingran",
                "title": "MD, CEO & Director",
                "pay": 8776000.0
            },
            {
                "name": "Mr. Sangramjit  Sarangi",
                "title": "Chief Financial Officer",
                "pay": 32662650.0
            },
            {
                "name": "Mr. Girish Mahesh Manik",
                "title": "Company Secretary & Compliance Officer",
                "pay": 1347310.0
            },
            {
                "name": "Mr. M.  Anand",
                "title": "President & Chief Distribution Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. G.  Durgadas",
                "title": "President of Operations & IT",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Gopikrishna  Shenoy",
                "title": "Chief Investment Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ravindra  Sharma",
                "title": "SVP and Chief of Brand, Corporate Communications & CSR",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Subodh Kumar Jha",
                "title": "EVP and Chief of Human Resources & Management Services",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Abhijit  Gulanikar",
                "title": "President of Business Strategy",
                "pay": "Not Available"
            },
            {
                "name": "Smita  Verma",
                "title": "Senior Vice President",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "State Bank of India",
        "symbol": "SBIN.NS",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "city": "Mumbai",
        "website": "https://www.sbi.co.in"
    },
    {
        "type": "Business_Summary",
        "company": "State Bank of India",
        "symbol": "SBIN.NS",
        "summary": "State Bank of India provides banking products and services to individuals, commercial enterprises, corporates, public bodies, and institutional customers in India and internationally. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, Insurance Business, and Other Banking Business segments. It offers personal banking products and services, including current accounts, savings accounts, salary accounts, and fixed and recurring deposits; home, personal, auto, education, and gold loans, as well as loans against insurance policies, property, and securities; overdrafts; mutual funds, insurance, equity trading, portfolio investment schemes, remittance services; digital lending; and mobile, internet, and digital banking services. The company also provides corporate banking products and services comprising corporate accounts, working capital and project finance, deferred payment guarantees, corporate term loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms' overseas subsidiaries or JVs, and cash management, as well as trade and service products. In addition, it offers NRI services, including accounts and deposits, remittances, investments, and loans; agricultural banking services; supply chain finance, and deposits and transaction banking services for SME customers; and international banking services. Further, the company provides life and general insurance; estate planning services; and merchant banking, advisory, securities broking, business & management consultancy, trusteeship service, factoring, payment solution, asset management, investment management, credit cards, and custody and fund accounting services. The company was founded in 1806 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "State Bank of India",
        "symbol": "SBIN.NS",
        "audit_risk": 6.0,
        "board_risk": 8.0,
        "compensation_risk": 1.0,
        "shareholder_rights_risk": 4.0,
        "overall_risk": 5.0
    },
    {
        "type": "Executive_Details",
        "company": "State Bank of India",
        "symbol": "SBIN.NS",
        "executives": [
            {
                "name": "Mr. Ashwini Kumar Tewari",
                "title": "MD of Corporate Banking(CAG & CCG) & Subsidiaries and Director",
                "pay": 3931488.0
            },
            {
                "name": "Mr. Vinay M. Tonse",
                "title": "Managing Director of Retail Business & Operations and Director",
                "pay": 1378580.0
            },
            {
                "name": "Mr. Kameshwar Rao Kodavanti",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Pravin  Raghavendra",
                "title": "Deputy MD & COO",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rana Ashutosh Kumar Singh",
                "title": "Managing Director of Risk,Compliance & SARG",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Binod Kumar Mishra",
                "title": "Deputy MD of HR & Corporate Development Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Saloni  Narayan",
                "title": "Deputy Managing Director of Finance",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Nitin  Chugh",
                "title": "Deputy MD and Head of Digital Banking & Transformation",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Ruma  Dey",
                "title": "Deputy MD  & Group Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Vidya  Krishnan",
                "title": "Deputy Managing Director of Information Technology",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Shriram Finance Limited",
        "symbol": "SHRIRAMFIN.NS",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "city": "Mumbai",
        "website": "https://shriramfinance.in"
    },
    {
        "type": "Business_Summary",
        "company": "Shriram Finance Limited",
        "symbol": "SHRIRAMFIN.NS",
        "summary": "Shriram Finance Limited, a non-banking finance company, primarily engages in the provision of financing services in India. It offers fixed and recurring deposits; commercial vehicle loans for commercial goods vehicles, passenger vehicles, tractors and farm equipment, and construction equipment; and multi-utility vehicle, two-wheeler, gold, and personal loans. The company also provides business loans, such as small and medium enterprise loans; working capital loans, including tyre, tax, fuel, and toll financing, and repair/top-up loans and challan discounting; insurance products life, motor, personal accident, and home insurance products; and payment services. It serves first time buyers, small road transport operators, and individuals; and micro, small, and medium enterprises (MSMEs) customers consisting of self-employed professionals, wholesale and retail dealers, merchants, builders, small and medium scale manufacturing concerns, and service providers. The company was formerly known as Shriram Transport Finance Company Limited and changed its name to Shriram Finance Limited in November 2022. Shriram Finance Limited was incorporated in 1979 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Shriram Finance Limited",
        "symbol": "SHRIRAMFIN.NS",
        "audit_risk": 1.0,
        "board_risk": 2.0,
        "compensation_risk": 6.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 2.0
    },
    {
        "type": "Executive_Details",
        "company": "Shriram Finance Limited",
        "symbol": "SHRIRAMFIN.NS",
        "executives": [
            {
                "name": "Mr. Yalamati Srinivasa Chakravarti B.Com.",
                "title": "MD, CEO & Director",
                "pay": 9509767.0
            },
            {
                "name": "Mr. Umesh Govind Revankar",
                "title": "Executive Vice Chairman",
                "pay": 15711970.0
            },
            {
                "name": "Mr. Parag  Sharma",
                "title": "MD, CFO & Whole-Time Director",
                "pay": 9469666.0
            },
            {
                "name": "Mr. Ramasubramanian  Chandrasekar B.Com., ICWA",
                "title": "Joint MD & Chief Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. S.  Sunder",
                "title": "Joint Managing Director",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Hardeep  Singh Tur",
                "title": "Chief Risk Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Abhilash  Tewari",
                "title": "Head of Internal Audit",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Balasundararao  Uppu",
                "title": "Company Secretary & Compliance officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Sun Pharmaceutical Industries Limited",
        "symbol": "SUNPHARMA.NS",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "city": "Mumbai",
        "website": "https://www.sunpharma.com"
    },
    {
        "type": "Business_Summary",
        "company": "Sun Pharmaceutical Industries Limited",
        "symbol": "SUNPHARMA.NS",
        "summary": "Sun Pharmaceutical Industries Limited, a generic pharmaceutical company, develops, manufactures, and markets branded and generic formulations and active pharmaceutical ingredients (APIs) in India and internationally. The company offers formulations in various therapeutic areas, including central nervous system, dermatology, cardiology, oncology, neuropsychiatry, gastroenterology, anti-infectives, diabetology, pain/analgesics, vitamins/minerals/nutrients, respiratory, gynaecology, urology, ophthalmology, orthopaedic, nephrology, dental, and other areas. It provides APIs for anti-cancers, peptides, steroids, hormones, and immunosuppressant drugs. In addition, the company offers generic medications, such as tablets, capsules, injectables, inhalers, ointments, creams, and liquids; speciality medications, and antiretrovirals medications, as well as over-the-counter products. The company was founded in 1983 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Sun Pharmaceutical Industries Limited",
        "symbol": "SUNPHARMA.NS",
        "audit_risk": 7.0,
        "board_risk": 5.0,
        "compensation_risk": 3.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 4.0
    },
    {
        "type": "Executive_Details",
        "company": "Sun Pharmaceutical Industries Limited",
        "symbol": "SUNPHARMA.NS",
        "executives": [
            {
                "name": "Mr. Dilip Shantilal Shanghvi",
                "title": "MD & Chairman of the Board",
                "pay": 60541920.0
            },
            {
                "name": "Mr. Aalok Dilip Shanghvi",
                "title": "Executive VP, Head of Emerging Markets, Global Generics R&D, Business Devp., and Whole Time Director",
                "pay": 68752907.0
            },
            {
                "name": "Mr. C. S. Muralidharan ICWA, M.Com",
                "title": "Chief Financial Officer",
                "pay": 38890000.0
            },
            {
                "name": "Mr. Davinder  Singh",
                "title": "Executive Vice-President of Global Operations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Dheeraj Prasad Sinha BE",
                "title": "EVP & Chief Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Dr. Abhishek  Sharma",
                "title": "VP, Head of Investor Relations & Strategic Projects",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Anoop  Deshpande",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Kalyanasundaram  Subramanian",
                "title": "Director of Corporate Development",
                "pay": 65298873.0
            },
            {
                "name": "Mr. Suresh Kumar Rai",
                "title": "Chief Human Resources Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Kirti Wardhaman Ganorkar",
                "title": "Head of India Business",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Tata Consumer Products Limited",
        "symbol": "TATACONSUM.NS",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "city": "Mumbai",
        "website": "https://www.tataconsumer.com"
    },
    {
        "type": "Business_Summary",
        "company": "Tata Consumer Products Limited",
        "symbol": "TATACONSUM.NS",
        "summary": "Tata Consumer Products Limited, together with its subsidiaries, produces, distributes, and trades in food products in India, the United States, the United Kingdom, and internationally. It operates through Branded Business and Non Branded Business segments. The company provides tea, coffee products, salt, mineral water, food ingredients, sweeteners, ready to cook and ready to eat options, breakfast cereals, snacks, mini meals, pulses, spices, sauces, chutney, pasta masala, ginger garlic paste, and dry fruits. It also offers health supplements; plant-based meat variants, including nuggets, burger patty, awadhi seekh kebab, and spicy fingers; honey and preserves; Chinese food products; glucose-based ready-to-serve drink; juices; and instant beverages. The company offers its products primarily under the Tata Tea, Tetley, 1868 by Tata Tea, Organic India, Tata Coffee Grand, Tata Coffee Gold, Tata Coffee Quick Filter, Sonnets by Tata Coffee, Tata Salt, Tata Sampann, Smith & Jones, Tata Sampann Yumside, Tata Soulfull, Himalayan honey and preserves, Ching's Secret, Tata Simply Better, Tata GoFit, Himalayan water, Tata Copper+, Tata Gluco+, Tata Fruski, Good Earth, Teapigs, Eight O'Clock, Tata Raasa, Joyfull Millets, Ching's Secret, Vitax, Laager, and Tea4Kidz brands. Tata Consumer Products Limited was formerly known as Tata Global Beverages Limited and changed its name to Tata Consumer Products Limited in February 2020. The company was incorporated in 1962 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Tata Consumer Products Limited",
        "symbol": "TATACONSUM.NS",
        "audit_risk": 2.0,
        "board_risk": 7.0,
        "compensation_risk": 7.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 6.0
    },
    {
        "type": "Executive_Details",
        "company": "Tata Consumer Products Limited",
        "symbol": "TATACONSUM.NS",
        "executives": [
            {
                "name": "Mr. Sunil Alaric D'Souza",
                "title": "MD, CEO & Executive Director",
                "pay": 101326000.0
            },
            {
                "name": "Mr. Ajit Sukumar Krishna Kumar",
                "title": "COO & Executive Director",
                "pay": 28304400.0
            },
            {
                "name": "Mr. Sivakumar  Sivasankaran",
                "title": "Senior VP & CFO of India",
                "pay": 17619000.0
            },
            {
                "name": "Mr. Punit  Gupta",
                "title": "President & Head of Sales for India",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ashish  Goenka",
                "title": "Group Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. S. K. Roychaudhuri",
                "title": "Chief Information Officer and Director of Application Support & Development - Asia Regions",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Nidhi  Verma",
                "title": "Head of Investor Relations & Corporate Communication",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rishi  Gautam",
                "title": "Global General Counsel",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Delnaz Dara Harda",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Tarun N P Varma",
                "title": "Global CHRO & Sustainability Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Tata Motors Limited",
        "symbol": "TATAMOTORS.NS",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "city": "Mumbai",
        "website": "https://www.tatamotors.com"
    },
    {
        "type": "Business_Summary",
        "company": "Tata Motors Limited",
        "symbol": "TATAMOTORS.NS",
        "summary": "Tata Motors Limited designs, develops, manufactures, and sells various automotive vehicles. The company offers passenger cars; sports utility vehicles; intermediate and light commercial vehicles; small, medium, and heavy commercial vehicles; defense vehicles; pickups, wingers, buses, vans, and trucks; and electric vehicles, as well as related spare parts and accessories. It also manufactures engines for industrial applications, and aggregates comprising axles and transmissions for commercial vehicles; and factory automation equipment, as well as provides information technology and vehicle financing services. The company offers its products under the Tata, Daewoo, Harrier, Safari, Fiat, Nexon, Altroz, Punch, Tiago, Tigor, Jaguar, and Land Rover brands. It operates in India, China, the United States, the United Kingdom, rest of Europe, and internationally. It offers its products to fleet owners, transporters, government agencies, defense, public transport utilities, small and medium enterprises (SMEs), agriculture and rural segment, mining and construction industry, etc. The company was incorporated in 1945 and is headquartered in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Tata Motors Limited",
        "symbol": "TATAMOTORS.NS",
        "audit_risk": 4.0,
        "board_risk": 6.0,
        "compensation_risk": 8.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 7.0
    },
    {
        "type": "Executive_Details",
        "company": "Tata Motors Limited",
        "symbol": "TATAMOTORS.NS",
        "executives": [
            {
                "name": "Mr. Pathamadai Balachandran Balaji",
                "title": "Group Chief Financial Officer",
                "pay": 149174000.0
            },
            {
                "name": "Mr. Maloy Kumar Gupta",
                "title": "Compliance Officer & Company Secretary",
                "pay": 14982000.0
            },
            {
                "name": "Mr. Girish Arun Wagh",
                "title": "President of Commercial Vehicles Business Unit & Executive Director",
                "pay": 54825000.0
            },
            {
                "name": "Mr. Petkar M. Rajendra",
                "title": "CTO & President",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Rajesh  Kannan",
                "title": "President and Chief Digital & Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Namrata  Divekar",
                "title": "Head of Treasury and Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sudeep  Bhalla",
                "title": "Head of Corporate Communications",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Shubhranshu  Singh",
                "title": "Vice President of Marketing of Domestic & International business",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sitaram  Kandi",
                "title": "Chief Human Resource Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. R.  Ramakrishnan",
                "title": "Global Head of Customer Care",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Tata Steel Limited",
        "symbol": "TATASTEEL.NS",
        "sector": "Basic Materials",
        "industry": "Steel",
        "city": "Mumbai",
        "website": "https://www.tatasteel.com"
    },
    {
        "type": "Business_Summary",
        "company": "Tata Steel Limited",
        "symbol": "TATASTEEL.NS",
        "summary": "Tata Steel Limited engages in the manufacture and distribution of steel products in India and internationally. It offers hot rolled (HR), cold-rolled, direct-rolled, cold rolled closed annealed (CRCA), galvanized, galvanized corrugated, HR commercial, HR slit, medium carbon/high carbon, structural and precision tube, wire rod, billet, metallic and organic coated coil and sheet, conveyance and line pipe, electro-plated steel, tailor welded blank, and aluminium blank, and BP sheet products. The company also provides hot rolled pickled and oiled, hot rolled skin passed pickled and oiled, pre-engineered building, full hard cold rolled, galv, galume, galvano, PPGI, PPGL, panel and profile, lintel, roof and cladding system, slab, highway system, high tensile steel strapping, electro-plated coil, tin plate, tin-free steel, laminated steel coil and sheet, thermo mechanically treated rebar, cut and bend, stirrup, dowel, footing, and angle and channel products. It offers its products for automotive, construction, industrial and general engineering, and consumer durables industries. The company was incorporated in 1907 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Tata Steel Limited",
        "symbol": "TATASTEEL.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "Tata Steel Limited",
        "symbol": "TATASTEEL.NS",
        "executives": [
            {
                "name": "Mr. Thachat Viswanath Narendran",
                "title": "CEO, MD & Executive Director",
                "pay": 174507000.0
            },
            {
                "name": "Mr. Koushik  Chatterjee B.Com. (Hons), F.C.A.",
                "title": "CFO & Executive Director",
                "pay": 136101000.0
            },
            {
                "name": "Mr. Parvatheesam  Kanchinadham",
                "title": "Company Secretary & Chief Legal Officer (Corporate & Compliance)",
                "pay": "Not Available"
            },
            {
                "name": "Hriday  Nair",
                "title": "Chief of Corporate Finance & Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Subodh  Pandey",
                "title": "Vice President of Technology, R&D, NMB and Graphene",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Jayanta  Banerjee",
                "title": "Chief Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ritu Raj Sinha",
                "title": "Chief of Corporate Administration",
                "pay": "Not Available"
            },
            {
                "name": "Sarvesh  Kumar",
                "title": "Chief of Corporate Communication",
                "pay": "Not Available"
            },
            {
                "name": "Siddharth  Mishra",
                "title": "Chief of Marketing & Sales",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Atrayee Sarkar Sanyal",
                "title": "Vice President of Human Resource Management",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Tata Consultancy Services Limited",
        "symbol": "TCS.NS",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "city": "Mumbai",
        "website": "https://www.tcs.com"
    },
    {
        "type": "Business_Summary",
        "company": "Tata Consultancy Services Limited",
        "symbol": "TCS.NS",
        "summary": "Tata Consultancy Services Limited provides information technology (IT) and IT enabled services in the Americas, Europe, India, and internationally. It operates through Banking, Financial Services and Insurance; Manufacturing; Consumer Business; Communication, Media and Technology; Life Sciences and Healthcare; and Others segments. The company provides TCS ADD, a suite of technology platforms for clinical research and drug development; TCS BaNCS, a financial services platform; TCS BFSI Platforms, a cloud-native, as-a-service that helps financial institutions and insurance firms; TCS CHROMA, a cloud-based workforce management solution; customer intelligence and insight solutions; TCS ERP on Cloud, a hosted ERP applications and services platform; TCS HOBS, a cloud-native catalog-centric platform for personalization of products and processes; and ignio, an autonomous enterprise software. It also offers TCS Intelligent Urban Exchange for smart cities and enterprises solution; TCS OmniStore, a retail commerce platform; TCS Optumera, a retail-connected strategic intelligence platform; TCS TAP, a procurement offering; TCS MasterCraft, a platform of intelligent automation products; Quartz- the Smart Ledgers, a blockchain solution; Jile, an enterprise agile planning and delivery tool; TCS iON, an IT-as-a-Service model that provides business solutions; and TCS TwinX, an enterprise digital twin platform. In addition, the company offers cloud, cognitive business, consulting, cybersecurity, data and analytics, enterprise solutions, Internet of Things and digital engineering, TCS interactive, and sustainability services. It serves banking; capital markets; consumer goods and distribution; communications, media, and information services; education; energy, resources, and utilities; healthcare; high technology; insurance; life sciences; manufacturing; public services; retail; and travel and logistics industries. The company was founded in 1968 and is based in Mumbai, India. Tata Consultancy Services Limited is a subsidiary of Tata Sons Private Limited."
    },
    {
        "type": "Risk_Profile",
        "company": "Tata Consultancy Services Limited",
        "symbol": "TCS.NS",
        "audit_risk": 1.0,
        "board_risk": 7.0,
        "compensation_risk": 1.0,
        "shareholder_rights_risk": 8.0,
        "overall_risk": 3.0
    },
    {
        "type": "Executive_Details",
        "company": "Tata Consultancy Services Limited",
        "symbol": "TCS.NS",
        "executives": [
            {
                "name": "Mr. K.  Krithivasan B.E, M.Tech.",
                "title": "MD, CEO & Director",
                "pay": 256140000.0
            },
            {
                "name": "Mr. Samir  Seksaria",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Dr. Harrick  Vin",
                "title": "Chief Technology Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Sukanya  Sadasivan B.E",
                "title": "Senior VP & Chief Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Kedar  Shirali",
                "title": "Head of Global Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Madhav  Anchan",
                "title": "General Counsel Legal",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Yashaswin  Sheth",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vivek  Padiyar",
                "title": "Head of Corporate Communications",
                "pay": "Not Available"
            },
            {
                "name": "Abhinav  Kumar",
                "title": "Chief Marketing Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Milind  Lakkad M.Tech.",
                "title": "Executive VP & Chief Human Resources Officer",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Tech Mahindra Limited",
        "symbol": "TECHM.NS",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "city": "Pune",
        "website": "https://www.techmahindra.com"
    },
    {
        "type": "Business_Summary",
        "company": "Tech Mahindra Limited",
        "symbol": "TECHM.NS",
        "summary": "Tech Mahindra Limited provides information technology services and solutions in the Americas, Europe, India, and internationally. The company operates through Information technology (IT) Business and Business Processing Outsourcing (BPO) segments. It offers cloud consulting, business excellence, digital supply chain, Application Development Maintenance, intelligent automation, testing, performance engineering, data analytics, and artificial intelligence services. The company also provides infrastructure and cloud services, including cloud, FLEX Digital workplace, and data center; engineering and network services; digital enterprise applications; and business process, cyber security, blockchain, and metaverse services, as well as customer experience and sustainability as a service. It serves communication; banking and financial services; energy and utilities; healthcare and life sciences; hi-tech; insurance; manufacturing; media and entertainment; private equity; oil and gas; professional service; and travel, transportation, hospitality, and logistic sectors. The company was incorporated in 1986 and is based in Pune, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Tech Mahindra Limited",
        "symbol": "TECHM.NS",
        "audit_risk": 2.0,
        "board_risk": 3.0,
        "compensation_risk": 10.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 7.0
    },
    {
        "type": "Executive_Details",
        "company": "Tech Mahindra Limited",
        "symbol": "TECHM.NS",
        "executives": [
            {
                "name": "Mr. Mohit  Joshi",
                "title": "CEO, MD & Director",
                "pay": 245467390.0
            },
            {
                "name": "Mr. Rohit  Anand",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Atul  Soneja",
                "title": "Chief Operating Officer",
                "pay": 26000000.0
            },
            {
                "name": "Ms. Pallavi  Katiyar",
                "title": "Chief Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Kaustubh  Vaidya C.F.A.",
                "title": "Head of Investor Relations",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Ruchie  Khanna",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Abhilasha  Gupta",
                "title": "Head of Corporate Communications & Public Affairs",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Peeyush  Dubey",
                "title": "Chief Marketing Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Richard  Lobo",
                "title": "Chief People Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Marcus  Schüler",
                "title": "Senior Vice President of MBT GmbH",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Titan Company Limited",
        "symbol": "TITAN.NS",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "city": "Bengaluru",
        "website": "https://www.titancompany.in"
    },
    {
        "type": "Business_Summary",
        "company": "Titan Company Limited",
        "symbol": "TITAN.NS",
        "summary": "Titan Company Limited, together with its subsidiaries, manufactures and sells watches, jewelry, eyewear, and other accessories and products in India and internationally. It operates through four segments: Watches and Wearables, Jewellery, Eyecare, and Others. The company designs, manufactures, and retails watches and wearables under the Nebula by Titan, Xylys, Edge by Titan, Raga by Titan, Titan, Fastrack, Vyb by Fastrack, Sonata, POZE Sonata, ZOOP by Titan, Titan Clocks, Octane Titan, Fastrack Smart, Titan Smart, SF, Titan World, and Helios brands; jewelry products under the Mia by Tanishq, CaratLane, Tanishq, and Zoya brand names; and eyecare products under the Titan EyePlus and Fastrack Eyecare brands. It also offers sarees, dress materials, and ready-to-wear kurtas under the Taneira brand; perfumes under the SKINN by Titan brand name; belts and wallets under the TITAN brand; and bags under the Fastrack and IRTH brand names. In addition, it provides manufacturing services and automation solutions for aerospace, defense, transportation, electrical and electronics, and medical sectors. It offers its products through owned and franchised retail stores, as well as online. The company was formerly known as Titan Industries Limited and changed its name to Titan Company Limited in August 2013. Titan Company Limited was incorporated in 1984 and is based in Bengaluru, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Titan Company Limited",
        "symbol": "TITAN.NS",
        "audit_risk": 4.0,
        "board_risk": 7.0,
        "compensation_risk": 7.0,
        "shareholder_rights_risk": 5.0,
        "overall_risk": 6.0
    },
    {
        "type": "Executive_Details",
        "company": "Titan Company Limited",
        "symbol": "TITAN.NS",
        "executives": [
            {
                "name": "Mr. Coimbatore Krishnamurthy Venkataraman B.Sc., PGDM",
                "title": "MD & Director",
                "pay": 124708521.0
            },
            {
                "name": "Mr. Ashok Kumar Sonthalia A.C.A., B.Sc.",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ravi  Kuppuraj",
                "title": "COO & Business Head of Titan Smart Wearables Business",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Krishnan  Venkateswaran",
                "title": "Chief Digital & Information Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Dinesh Shivanna Shetty",
                "title": "General Counsel, Compliance Officer & Company Secretary",
                "pay": 8162400.0
            },
            {
                "name": "Mr. Swadesh Kumar Behera",
                "title": "Chief People Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ajoy  Chawla B.E., PGDM",
                "title": "Chief Executive Officer- Jewellery",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Arun  Narayan",
                "title": "VP & Head of Retail Tanishq",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Revathi  Kant",
                "title": "Chief Design Officer",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Suparna  Mitra",
                "title": "Chief Executive Officer - Watches and Wearables Division",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Trent Limited",
        "symbol": "TRENT.NS",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "city": "Mumbai",
        "website": "https://trentlimited.com"
    },
    {
        "type": "Business_Summary",
        "company": "Trent Limited",
        "symbol": "TRENT.NS",
        "summary": "Trent Limited engages in the retailing and trading of apparels, footwear, accessories, toys, games, and other products in India. The company provides apparel, footwear, and accessories for men, women, and children, as well as furnishings, decor, and a range of home accessories under the Westside brand; apparels and footwear for men, women, and children under the Zudio brand; ethnic apparels, beauty products, and accessories under the Utsa brand; beauty products and accessories for girls under the Misbu brand; and luxurious occasion and ethnic wear for men and women under the Samoh brand. It also operates Star Hypermarket, a convenience store chain that offers a range of products, including staple foods, beverages, health and beauty products, apparel, home furnishings, vegetables, fruits, dairy and non-vegetarian products; and Booker Wholesale, a cash and carry chain of stores, which provides various products, such as staple foods, beverages, health and beauty products, dairy, non-vegetarian products, and non-food products to caterers, retailers, and other businesses. In addition, the company engages in the operation of StarQuik for online grocery retailing; provision of business support and outsourcing services relating to accounting, merchandising, human resources, payroll, etc.; and franchisee business. Further, it sells its products online through Westside.com, Tata CliQ, and Tata Neu. Trent Limited was incorporated in 1952 and is based in Mumbai, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Trent Limited",
        "symbol": "TRENT.NS",
        "audit_risk": "Not Available",
        "board_risk": "Not Available",
        "compensation_risk": "Not Available",
        "shareholder_rights_risk": "Not Available",
        "overall_risk": "Not Available"
    },
    {
        "type": "Executive_Details",
        "company": "Trent Limited",
        "symbol": "TRENT.NS",
        "executives": [
            {
                "name": "Mr. Venkatesalu  Palaniswamy",
                "title": "CEO & Executive Director",
                "pay": 70900000.0
            },
            {
                "name": "Mr. Neeraj  Basur ACA, ACS, M.Com",
                "title": "Chief Financial Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. P. K. Anand",
                "title": "Senior Vice-President of Operations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. S. W. Kamat",
                "title": "General Manager of Finance & Accounts",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Krupa Ketan Anandpara",
                "title": "Company Secretary & Compliance Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Manish  Kumar B.Sc., M.S.J.R., M.Sc., P.G.D.P.",
                "title": "Head of Human Recourse",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sanjay  Rastogi",
                "title": "Head - New Business, Strategy, CSR & ESG",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Shailesh  Solkar",
                "title": "Head of Merchandising & Supply Chain",
                "pay": "Not Available"
            },
            {
                "name": "Damani  Madhulika",
                "title": "Head of Indian Wear",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ratul  Neogi",
                "title": "Head of Internal Audit & BR",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "UltraTech Cement Limited",
        "symbol": "ULTRACEMCO.NS",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "city": "Mumbai",
        "website": "https://www.ultratechcement.com"
    },
    {
        "type": "Business_Summary",
        "company": "UltraTech Cement Limited",
        "symbol": "ULTRACEMCO.NS",
        "summary": "UltraTech Cement Limited, together with its subsidiaries, primarily engages in the manufacture and sale of clinker, cement, and related products in India. The company offers ordinary Portland, Portland pozzolana, composite, Portland slag, water-repellent, and white cement products; wall care putty, and specialty and ready-mix concretes; concrete blocks; and dry mix mortars, such as tile and marble binders, plasters and mortars, industrial and precision grouts, and flooring screeds, as well as repair and rehabilitation materials. It also provides waterproofing systems, including liquid and cementitious waterproofing products; and engages in the generation of electricity through wind and solar plants. In addition, the company operates retail stores under UltraTech Home Expert Store brand name that sells building materials, such as TMT steel bars, paints, waterproofing solutions and treatments, switchboards and fittings, plywood, shuttering ply, power and hand tools, PVC pipes, sanitary ware, roofing sheets, and water storage tanks, as well as flooring materials, such as marble, granite, and semi-precious stones; operates mobile concrete labs that offers on-ground technical assessment of construction materials; and provides Vastu, pest control, and water testing services, as well as home loans. It offers its products under UltraTech, Enviroplus, Décor, MaxSheen, DuraFacad, Previous, iFloors, ZIP, AquaSeal, ThermoCon+, FireSafe, Rapid, FreeFlow+, CorroProtect, DuraPlus, and LiteCon brands. The company exports its products to the United Arab Emirates, Bahrain, and Sri Lanka. UltraTech Cement Limited was incorporated in 2000 and is based in Mumbai, India. UltraTech Cement Limited operates as a subsidiary of Grasim Industries Limited."
    },
    {
        "type": "Risk_Profile",
        "company": "UltraTech Cement Limited",
        "symbol": "ULTRACEMCO.NS",
        "audit_risk": 8.0,
        "board_risk": 9.0,
        "compensation_risk": 7.0,
        "shareholder_rights_risk": 8.0,
        "overall_risk": 9.0
    },
    {
        "type": "Executive_Details",
        "company": "UltraTech Cement Limited",
        "symbol": "ULTRACEMCO.NS",
        "executives": [
            {
                "name": "Mr. Kailash Chandra Jhanwar B.Com, C.S (Inter), FCA",
                "title": "MD & Whole-time Director",
                "pay": 186800000.0
            },
            {
                "name": "Mr. Atul  Daga",
                "title": "Chief Financial Officer",
                "pay": 91600000.0
            },
            {
                "name": "Mr. Pramod  Rajgaria",
                "title": "President of International Operations",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Mukesh B. Agarwal",
                "title": "Executive President of Corporate Finance Division",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sanjeeb Kumar Chatterjee",
                "title": "Compliance Officer & Company Secretary",
                "pay": "Not Available"
            },
            {
                "name": "Dr. Pragnya  Ram",
                "title": "Group Executive President of Corporate Communication & CSR",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Vivek  Agrawal B.Tech., M.B.A.",
                "title": "Whole-time Director & Chief Marketing Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Chandrashekhar  Chavan",
                "title": "Chief Human Resources Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. E. R. Raj Narayanan",
                "title": "Chief Manufacturing Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Ashish  Dwivedi",
                "title": "Chief Executive Officer of Birla White",
                "pay": "Not Available"
            }
        ]
    },
    {
        "type": "General_Information",
        "company": "Wipro Limited",
        "symbol": "WIPRO.NS",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "city": "Bengaluru",
        "website": "https://www.wipro.com"
    },
    {
        "type": "Business_Summary",
        "company": "Wipro Limited",
        "symbol": "WIPRO.NS",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services company worldwide. It operates through IT Services and IT Products segments. The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology and IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, cloud and infrastructure, business process, cloud, mobility and analytics, research and development, and hardware and software design services to enterprises. It serves customers in various industry sectors, such as communications, retail connectivity and services, consumer goods, healthcare, technology products and platforms, banking and financial services, energy, manufacturing and resources, capital markets and insurance, and hi-tech. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the Indian market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The company was incorporated in 1945 and is based in Bengaluru, India."
    },
    {
        "type": "Risk_Profile",
        "company": "Wipro Limited",
        "symbol": "WIPRO.NS",
        "audit_risk": 1.0,
        "board_risk": 3.0,
        "compensation_risk": 9.0,
        "shareholder_rights_risk": 4.0,
        "overall_risk": 3.0
    },
    {
        "type": "Executive_Details",
        "company": "Wipro Limited",
        "symbol": "WIPRO.NS",
        "executives": [
            {
                "name": "Mr. Rishad Azim Hasham Premji Jr.",
                "title": "Executive Chairman",
                "pay": 64573347.0
            },
            {
                "name": "Ms. Aparna C. Iyer",
                "title": "CFO, Corporate Treasurer, Investor Relations & Member of Executive Board",
                "pay": 18717942.0
            },
            {
                "name": "Mr. Srinivas  Pallia",
                "title": "CEO, MD, Executive Director & Member of Executive Board",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Saurabh  Govil",
                "title": "Chief Human Resources Officer & Executive Board Member",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Nagendra P. Bandaru",
                "title": "Managing Partner of Wipro Enterprise Futuring & Executive Board Member",
                "pay": "Not Available"
            },
            {
                "name": "Ms. Suzanne  Dann",
                "title": "CEO of Americas 2 & Executive Board Member",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Jo  Debecker",
                "title": "Global Head of Wipro FullStride Cloud & Member of Executive Board",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Malay  Joshi",
                "title": "CEO for Americas 1 Strategic Market Unit & Member of Executive Board",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Sanjeev  Jain",
                "title": "Chief Operating Officer",
                "pay": "Not Available"
            },
            {
                "name": "Mr. Omkar Bhalchandra Nisal",
                "title": "CEO of Europe Strategic Market Unit & Member of Executive Board",
                "pay": "Not Available"
            }
        ]
    }
]